{
    "1": ".",
    "2": "the",
    "3": "a",
    "4": "to",
    "5": "and",
    "6": "of",
    "7": "is",
    "8": "in",
    "9": "we",
    "10": "you",
    "11": "that",
    "12": "for",
    "13": "=",
    "14": "are",
    "15": "it",
    "16": "as",
    "17": ">>>",
    "18": "can",
    "19": "if",
    "20": "this",
    "21": "an",
    "22": "with",
    "23": "python",
    "24": "data",
    "25": "program",
    "26": "from",
    "27": "or",
    "28": "be",
    "29": "have",
    "30": "at",
    "31": "when",
    "32": "use",
    "33": "by",
    "34": "on",
    "35": "not",
    "36": "using",
    "37": "list",
    "38": "so",
    "39": "will",
    "40": "but",
    "41": "line",
    "42": "one",
    "43": "string",
    "44": "each",
    "45": "our",
    "46": "your",
    "47": "function",
    "48": "all",
    "49": "chapter",
    "50": "which",
    "51": "more",
    "52": "\ufb01le",
    "53": "there",
    "54": "loop",
    "55": "value",
    "56": "#",
    "57": "1",
    "58": "then",
    "59": "what",
    "60": "into",
    "61": "write",
    "62": "database",
    "63": "variable",
    "64": "lines",
    "65": "x",
    "66": "code",
    "67": "some",
    "68": "\ufb01rst",
    "69": "like",
    "70": "table",
    "71": "object",
    "72": "has",
    "73": "name",
    "74": "|",
    "75": "regular",
    "76": "called",
    "77": "where",
    "78": "they",
    "79": "two",
    "80": "number",
    "81": "want",
    "82": "2",
    "83": "values",
    "84": "same",
    "85": "print",
    "86": "see",
    "87": "these",
    "88": "many",
    "89": "do",
    "90": "read",
    "91": "i",
    "92": "how",
    "93": "get",
    "94": "because",
    "95": "following",
    "96": "out",
    "97": "characters",
    "98": "make",
    "99": "example,",
    "100": "call",
    "101": "new",
    "102": "user",
    "103": "count",
    "104": "enter",
    "105": "than",
    "106": "expression",
    "107": "through",
    "108": "while",
    "109": "statement",
    "110": "very",
    "111": "would",
    "112": "end",
    "113": "look",
    "114": "word",
    "115": "method",
    "116": "used",
    "117": "functions",
    "118": "file",
    "119": "other",
    "120": "time",
    "121": "web",
    "122": "words",
    "123": "character",
    "124": "language",
    "125": "create",
    "126": "any",
    "127": "text",
    "128": "key",
    "129": "also",
    "130": "most",
    "131": "need",
    "132": "code:",
    "133": "run",
    "134": "only",
    "135": "class",
    "136": "before",
    "137": "programs",
    "138": "was",
    "139": "us",
    "140": "might",
    "141": "start",
    "142": "between",
    "143": "statements",
    "144": "no",
    "145": "up",
    "146": "second",
    "147": "+",
    "148": "exercise",
    "149": "set",
    "150": "simple",
    "151": "1,",
    "152": "output",
    "153": "expressions",
    "154": "5",
    "155": "type",
    "156": "import",
    "157": "about",
    "158": "way",
    "159": "function,",
    "160": "track",
    "161": "follows:",
    "162": "its",
    "163": "0",
    "164": "could",
    "165": "sequence",
    "166": "syntax",
    "167": "index",
    "168": "example",
    "169": "3",
    "170": "programming",
    "171": "\ufb01nd",
    "172": "input",
    "173": "strings",
    "174": "tuples",
    "175": "should",
    "176": "take",
    "177": "add",
    "178": "error",
    "179": "y",
    "180": "try",
    "181": "lists",
    "182": "dictionary",
    "183": "another",
    "184": "does",
    "185": "operator",
    "186": "just",
    "187": "primary",
    "188": "simply",
    "189": "id",
    "190": "artist",
    "191": "di\ufb00erent",
    "192": "insert",
    "193": "match",
    "194": "\u2022",
    "195": "book",
    "196": "common",
    "197": "sql",
    "198": "know",
    "199": "single",
    "200": "returns",
    "201": "numbers",
    "202": "problem",
    "203": "don\u2019t",
    "204": "page",
    "205": ">",
    "206": "2,",
    "207": "search",
    "208": "-",
    "209": "over",
    "210": "logical",
    "211": "them",
    "212": "...",
    "213": "since",
    "214": "open",
    "215": "even",
    "216": "tuple",
    "217": "figure",
    "218": "followed",
    "219": "*",
    "220": ":",
    "221": "xml",
    "222": "debugging",
    "223": "glossary",
    "224": "methods",
    "225": "retrieve",
    "226": "looking",
    "227": "program.",
    "228": "something",
    "229": "their",
    "230": "think",
    "231": "been",
    "232": "exercises",
    "233": "learn",
    "234": "keys",
    "235": "application",
    "236": "memory",
    "237": "list.",
    "238": "order",
    "239": "names",
    "240": "elements",
    "241": "once",
    "242": "t",
    "243": "select",
    "244": "variables",
    "245": "special",
    "246": "true",
    "247": "after",
    "248": "next",
    "249": "letter",
    "250": "extract",
    "251": "within",
    "252": "element",
    "253": "computer",
    "254": "part",
    "255": "built-in",
    "256": "html",
    "257": "email",
    "258": "work",
    "259": "were",
    "260": "three",
    "261": "course",
    "262": "json",
    "263": "writing",
    "264": "b",
    "265": "both",
    "266": "much",
    "267": "integer",
    "268": "(",
    "269": "who",
    "270": "conditional",
    "271": "def",
    "272": "return",
    "273": "sqlite>",
    "274": "data.",
    "275": "execution",
    "276": "dictionaries",
    "277": "multiple",
    "278": "information",
    "279": "now",
    "280": "\ufb01le,",
    "281": "parsing",
    "282": "line.",
    "283": "interpreter",
    "284": "iteration",
    "285": "continue",
    "286": "assignment",
    "287": "program,",
    "288": "may",
    "289": "sometimes",
    "290": "break",
    "291": "name:",
    "292": "looks",
    "293": "list,",
    "294": "object.",
    "295": "uses",
    "296": "row",
    "297": "few",
    "298": "\ufb01les",
    "299": "often",
    "300": "contains",
    "301": "store",
    "302": "must",
    "303": "false",
    "304": "those",
    "305": "string,",
    "306": "last",
    "307": "here",
    "308": "empty",
    "309": "title",
    "310": "databases",
    "311": "instead",
    "312": "written",
    "313": "until",
    "314": "why",
    "315": "beautifulsoup",
    "316": "say",
    "317": "check",
    "318": "indicate",
    "319": "from:",
    "320": "key,",
    "321": "rows",
    "322": "such",
    "323": "pages",
    "324": "objects",
    "325": "above",
    "326": "takes",
    "327": "works",
    "328": "pattern",
    "329": "==",
    "330": "[",
    "331": "except",
    "332": "change",
    "333": "types",
    "334": "reading",
    "335": "good",
    "336": "already",
    "337": "string.",
    "338": "value.",
    "339": "method,",
    "340": "matches",
    "341": "socket",
    "342": "10",
    "343": "browser",
    "344": "command",
    "345": "construct",
    "346": "without",
    "347": "long",
    "348": "right",
    "349": "execute",
    "350": "integer,",
    "351": "named",
    "352": ")",
    "353": "statement.",
    "354": "<",
    "355": "argument",
    "356": "item",
    "357": "total",
    "358": "jan",
    "359": "fhand",
    "360": "sort",
    "361": "similar",
    "362": "documentation",
    "363": "loops",
    "364": "/",
    "365": "times",
    "366": "give",
    "367": "stored",
    "368": "\ufb01le.",
    "369": "avoid",
    "370": "unique",
    "371": "quite",
    "372": "contents",
    "373": "6",
    "374": "16",
    "375": "tables",
    "376": "sample",
    "377": "reserved",
    "378": "none",
    "379": "back",
    "380": "source",
    "381": "counts",
    "382": "document",
    "383": "sure",
    "384": "case",
    "385": "body",
    "386": "largest",
    "387": "parameter",
    "388": "stephen.marquard@uct.ac.za",
    "389": "examples",
    "390": "available",
    "391": "useful",
    "392": "4",
    "393": "29",
    "394": "random",
    "395": "urllib",
    "396": "understand",
    "397": "main",
    "398": "starts",
    "399": "smallest",
    "400": "indicates",
    "401": "statement,",
    "402": "expression,",
    "403": "condition",
    "404": "module",
    "405": "particular",
    "406": "column",
    "407": "my",
    "408": "object-oriented",
    "409": "operations",
    "410": "tell",
    "411": "processing",
    "412": "network",
    "413": "left",
    "414": "beginning",
    "415": "errors",
    "416": "makes",
    "417": "n",
    "418": ">=",
    "419": "items",
    "420": "open('mbox-short.txt')",
    "421": "['a',",
    "422": "'b',",
    "423": "handle",
    "424": "nested",
    "425": "100",
    "426": "mail",
    "427": "(or",
    "428": "put",
    "429": "messages",
    "430": "3,",
    "431": "slice",
    "432": "either",
    "433": "zero",
    "434": "table.",
    "435": "first",
    "436": "well",
    "437": "python.",
    "438": "possible",
    "439": "build",
    "440": "retrieving",
    "441": "visualizing",
    "442": "lot",
    "443": "python,",
    "444": "operators",
    "445": "32",
    "446": "45",
    "447": "files",
    "448": "programmers",
    "449": "machine",
    "450": "runs",
    "451": "process",
    "452": "')",
    "453": "download",
    "454": "(i.e.,",
    "455": "parse",
    "456": "prints",
    "457": "parentheses",
    "458": "allows",
    "459": "loop,",
    "460": "split",
    "461": "sorted",
    "462": "dictionary,",
    "463": "key-value",
    "464": "role",
    "465": "class.",
    "466": "always",
    "467": "quickly",
    "468": "go",
    "469": "40",
    "470": "53",
    "471": "128",
    "472": "extracting",
    "473": "applications",
    "474": "1.",
    "475": "software",
    "476": "secondary",
    "477": "keep",
    "478": "later",
    "479": "pass",
    "480": "invalid",
    "481": "refer",
    "482": "shown",
    "483": "little",
    "484": "result",
    "485": "<class",
    "486": "format",
    "487": "stuff",
    "488": "join",
    "489": "keyword",
    "490": "several",
    "491": "character.",
    "492": "url",
    "493": "ignore",
    "494": "(title,",
    "495": "foreign",
    "496": "never",
    "497": "me",
    "498": "include",
    "499": "15",
    "500": "adding",
    "501": "92",
    "502": "117",
    "503": "120",
    "504": "protocol",
    "505": "javascript",
    "506": "connection",
    "507": "computers",
    "508": "usually",
    "509": "high-level",
    "510": "parts",
    "511": "time.",
    "512": "point",
    "513": "appears",
    "514": "too",
    "515": "traceback",
    "516": "actual",
    "517": "far",
    "518": "convert",
    "519": "reads",
    "520": "it.",
    "521": "rules",
    "522": "less",
    "523": "produces",
    "524": "c",
    "525": "shows",
    "526": "added",
    "527": "loop.",
    "528": "output:",
    "529": "2008",
    "530": "newline",
    "531": "fhand:",
    "532": "re",
    "533": "5120",
    "534": "drop",
    "535": "member",
    "536": "version",
    "537": "university",
    "538": "running",
    "539": "book,",
    "540": "given",
    "541": "recent",
    "542": "making",
    "543": "length",
    "544": "94",
    "545": "users",
    "546": "http",
    "547": "services",
    "548": "api",
    "549": "sqlite",
    "550": "basic",
    "551": "model",
    "552": "best",
    "553": "going",
    "554": "complex",
    "555": "cannot",
    "556": "words,",
    "557": "equivalent",
    "558": "message",
    "559": "sign",
    "560": "1:",
    "561": "contain",
    "562": "letters",
    "563": "assigned",
    "564": "operator,",
    "565": "access",
    "566": "side",
    "567": "'banana'",
    "568": "find",
    "569": "sat",
    "570": "mbox-short.txt",
    "571": "line.rstrip()",
    "572": "dictionary.",
    "573": "server",
    "574": "attributes",
    "575": "text,",
    "576": "self.x",
    "577": "party",
    "578": "table,",
    "579": "columns",
    "580": "artist_id",
    "581": "update",
    "582": "structure",
    "583": "important",
    "584": "building",
    "585": "11",
    "586": "expressions,",
    "587": "boolean",
    "588": "calls",
    "589": "95",
    "590": "things",
    "591": "ask",
    "592": "perhaps",
    "593": "means",
    "594": "down",
    "595": "rest",
    "596": "least",
    "597": "time,",
    "598": "prompt",
    "599": "\"<stdin>\",",
    "600": "copy",
    "601": "allow",
    "602": "remember",
    "603": "42",
    "604": "bit",
    "605": "input('enter",
    "606": "17",
    "607": "large",
    "608": "doesn\u2019t",
    "609": "character,",
    "610": "name,",
    "611": "3.",
    "612": "header",
    "613": "function.",
    "614": "object,",
    "615": "spam",
    "616": "constructed",
    "617": "number:",
    "618": "09:14:16",
    "619": "exists",
    "620": "partyanimal",
    "621": "own",
    "622": "starting",
    "623": "learning",
    "624": "variables,",
    "625": "counting",
    "626": "getting",
    "627": "choose",
    "628": "solve",
    "629": "kind",
    "630": "instructions",
    "631": "power",
    "632": "form",
    "633": "actually",
    "634": "interactive",
    "635": "syntaxerror:",
    "636": "comes",
    "637": "really",
    "638": "inside",
    "639": "commands",
    "640": "code.",
    "641": "de\ufb01nition",
    "642": "cause",
    "643": "help",
    "644": "error,",
    "645": "previous",
    "646": "seen",
    "647": "creates",
    "648": "provides",
    "649": "de\ufb01ned",
    "650": "!=",
    "651": "blank",
    "652": "corresponding",
    "653": "calling",
    "654": "done",
    "655": "itervar",
    "656": "pull",
    "657": "mbox.txt",
    "658": "'c',",
    "659": "'c']",
    "660": "print(t)",
    "661": "110",
    "662": "...>",
    "663": "rank",
    "664": "printing",
    "665": "students",
    "666": "had",
    "667": "analysis",
    "668": "searching",
    "669": "across",
    "670": "creating",
    "671": "free",
    "672": "31",
    "673": "parameters",
    "674": "57",
    "675": "len",
    "676": "looping",
    "677": "76",
    "678": "7",
    "679": "123",
    "680": "lists,",
    "681": "notation",
    "682": "detail",
    "683": "system",
    "684": "hard",
    "685": "central",
    "686": "small",
    "687": "found",
    "688": "idea",
    "689": "test",
    "690": "come",
    "691": "(most",
    "692": "immediately",
    "693": "print(x)",
    "694": "statements.",
    "695": "display",
    "696": "top",
    "697": "delete",
    "698": "executed",
    "699": "2:",
    "700": "number.",
    "701": "strings.",
    "702": "2.",
    "703": "compute",
    "704": "ends",
    "705": "(x/y)",
    "706": "square",
    "707": "loop:",
    "708": "[1,",
    "709": "send",
    "710": "print(line)",
    "711": "hash",
    "712": "average",
    "713": "size",
    "714": "na",
    "715": "boo",
    "716": "tuples,",
    "717": "?",
    "718": "links",
    "719": "tags",
    "720": "attribute",
    "721": "15.",
    "722": "plays",
    "723": "constraint",
    "724": "material",
    "725": "teach",
    "726": "problems",
    "727": "nearly",
    "728": "appear",
    "729": "data,",
    "730": "pick",
    "731": "(e.g.,",
    "732": "programs?",
    "733": "44",
    "734": "46",
    "735": "47",
    "736": "patterns",
    "737": "64",
    "738": "105",
    "739": "127",
    "740": "matching",
    "741": "summary",
    "742": "image",
    "743": "started",
    "744": "concepts",
    "745": "python\u201d",
    "746": "\u201cwhat",
    "747": "easy",
    "748": "computer.",
    "749": "ways",
    "750": "place",
    "751": "pretty",
    "752": "variable.",
    "753": "it,",
    "754": "nice",
    "755": "last):",
    "756": "<module>",
    "757": "various",
    "758": "code,",
    "759": "created",
    "760": "four",
    "761": "entire",
    "762": "counts[word]",
    "763": "error.",
    "764": "approach",
    "765": "generally",
    "766": "5,",
    "767": "whether",
    "768": "represents",
    "769": "whole",
    "770": "values.",
    "771": "equal",
    "772": "print('x",
    "773": "colon",
    "774": "again,",
    "775": "clause",
    "776": "expression.",
    "777": "s",
    "778": "support",
    "779": "wanted",
    "780": "close",
    "781": "elements.",
    "782": "'d',",
    "783": "hand",
    "784": "plays,",
    "785": ");",
    "786": "rewrite",
    "787": "initial",
    "788": "license",
    "789": "networked",
    "790": "4.",
    "791": "structured",
    "792": "move",
    "793": "results",
    "794": "14",
    "795": "19",
    "796": "math",
    "797": "arguments",
    "798": "comparison",
    "799": "formatted",
    "800": "79",
    "801": "89",
    "802": "93",
    "803": "166",
    "804": "179",
    "805": "relationships",
    "806": "202",
    "807": "\u201cthink",
    "808": "built",
    "809": "designed",
    "810": "true,",
    "811": "unit",
    "812": "person",
    "813": "language.",
    "814": "programs,",
    "815": "hello",
    "816": "earlier",
    "817": "link",
    "818": "exactly",
    "819": "working",
    "820": "$",
    "821": "lets",
    "822": "interested",
    "823": "perform",
    "824": "skip",
    "825": "3:",
    "826": "integers",
    "827": "library",
    "828": "4,",
    "829": "8.",
    "830": "result.",
    "831": "base",
    "832": "end.",
    "833": "gets",
    "834": "chuck",
    "835": "assign",
    "836": "period",
    "837": "bad",
    "838": "greater",
    "839": "\ufb02ow",
    "840": "score",
    "841": "score:",
    "842": "dot",
    "843": "\ufb01nds",
    "844": "3]",
    "845": "debug",
    "846": "still",
    "847": "position",
    "848": "range",
    "849": "line,",
    "850": "value,",
    "851": "instance",
    "852": "note",
    "853": "lines.",
    "854": "modify",
    "855": "list:",
    "856": "relationship",
    "857": "sent",
    "858": "tuple,",
    "859": "hand:",
    "860": "parent",
    "861": "class,",
    "862": "database.",
    "863": "album",
    "864": "course_id",
    "865": "restart",
    "866": "remove",
    "867": "google",
    "868": "copyright",
    "869": "creative",
    "870": "b.",
    "871": "instead,",
    "872": "focus",
    "873": "doing",
    "874": "needed",
    "875": "programming,",
    "876": "language,",
    "877": "become",
    "878": "able",
    "879": "minimum",
    "880": "architecture",
    "881": "23",
    "882": "24",
    "883": "mnemonic",
    "884": "28",
    "885": "evaluation",
    "886": "58",
    "887": "immutable",
    "888": "74",
    "889": "section",
    "890": "unix",
    "891": "simplest",
    "892": "modeling",
    "893": "187",
    "894": "fast",
    "895": "having",
    "896": "else",
    "897": "needs",
    "898": "next?",
    "899": "programs.",
    "900": "memory,",
    "901": "is,",
    "902": "elif",
    "903": "thing",
    "904": "(which",
    "905": "let\u2019s",
    "906": "made",
    "907": "mistake",
    "908": "languages",
    "909": "order.",
    "910": "translate",
    "911": "translated",
    "912": "editor",
    "913": "dict()",
    "914": "sequences",
    "915": "capabilities",
    "916": "stores",
    "917": "ability",
    "918": "lowercase",
    "919": "executes",
    "920": "division",
    "921": "5.",
    "922": "digits",
    "923": "stops",
    "924": "space",
    "925": "numbers.",
    "926": "this:",
    "927": "else:",
    "928": "goes",
    "929": "guardian",
    "930": "1.0,",
    "931": "d",
    "932": "de\ufb01ne",
    "933": "specify",
    "934": "i'm",
    "935": "objects.",
    "936": "show",
    "937": "runs,",
    "938": "index,",
    "939": "address",
    "940": "method.",
    "941": "slice,",
    "942": "structures",
    "943": "lists.",
    "944": "element,",
    "945": "{",
    "946": "type,",
    "947": "expressions.",
    "948": "gmt",
    "949": "ssl",
    "950": "tag",
    "951": "spider",
    "952": "service",
    "953": "tables.",
    "954": "eyes)",
    "955": "'blue');",
    "956": "one-to-many",
    "957": "user_id",
    "958": "70,",
    "959": "92,",
    "960": "76,",
    "961": "understanding",
    "962": "book.",
    "963": "overall",
    "964": "changes",
    "965": "additional",
    "966": "general",
    "967": "reuse",
    "968": "thank",
    "969": "9,",
    "970": "hardware",
    "971": "12",
    "972": "asking",
    "973": "alternative",
    "974": "34",
    "975": "43",
    "976": "fruitful",
    "977": "void",
    "978": "70",
    "979": "71",
    "980": "opening",
    "981": "86",
    "982": "88",
    "983": "91",
    "984": "9",
    "985": "119",
    "986": "linux",
    "987": "binary",
    "988": "markup",
    "989": "problem.",
    "990": "explain",
    "991": "humans",
    "992": "almost",
    "993": "(the",
    "994": "directly",
    "995": "programmer",
    "996": "per",
    "997": "point,",
    "998": "becomes",
    "999": "del",
    "1000": "every",
    "1001": "conversation",
    "1002": "did",
    "1003": "communicate",
    "1004": "literal",
    "1005": "represented",
    "1006": "resulting",
    "1007": "script",
    "1008": "line.split()",
    "1009": "them.",
    "1010": "again",
    "1011": "computation",
    "1012": "5:",
    "1013": "assigns",
    "1014": "third",
    "1015": "variable,",
    "1016": "uppercase",
    "1017": "begin",
    "1018": "name.",
    "1019": "turns",
    "1020": "being",
    "1021": "values,",
    "1022": "evaluated",
    "1023": "m",
    "1024": "inp",
    "1025": "hour",
    "1026": "case,",
    "1027": "line:",
    "1028": "choice",
    "1029": "\ufb02oating-point",
    "1030": "10.",
    "1031": "indented",
    "1032": "false,",
    "1033": "yes",
    "1034": "compound",
    "1035": "0:",
    "1036": "executes,",
    "1037": "general,",
    "1038": "tracks",
    "1039": "program:",
    "1040": "type.",
    "1041": "string:",
    "1042": "matter",
    "1043": "zap",
    "1044": "\ufb01ve",
    "1045": "true:",
    "1046": "',",
    "1047": "none,",
    "1048": "this,",
    "1049": "assignment,",
    "1050": "alphabetical",
    "1051": "dir",
    "1052": "optional",
    "1053": "\ufb01les,",
    "1054": "lines,",
    "1055": "simpler",
    "1056": "eyes",
    "1057": "list()",
    "1058": "day",
    "1059": "mapping",
    "1060": "maps",
    "1061": "tables,",
    "1062": "key.",
    "1063": "entry",
    "1064": "enough",
    "1065": "preceding",
    "1066": "'fun'",
    "1067": "(1,",
    "1068": "addresses",
    "1069": "real",
    "1070": "documents",
    "1071": "web.",
    "1072": "retrieves",
    "1073": "keyword,",
    "1074": "child",
    "1075": "relational",
    "1076": "cursor",
    "1077": "way',",
    "1078": "sinatra',",
    "1079": "artist;",
    "1080": "?,",
    "1081": "si110",
    "1082": "0],",
    "1083": "visualize",
    "1084": "sakai",
    "1085": "content.sqlite",
    "1086": "67,",
    "1087": "68,",
    "1088": "under",
    "1089": "allen",
    "1090": "his",
    "1091": "series",
    "1092": "light",
    "1093": "including",
    "1094": "query",
    "1095": "around",
    "1096": "sentences",
    "1097": "compiler",
    "1098": "20",
    "1099": "operands",
    "1100": "modulus",
    "1101": "25",
    "1102": "35",
    "1103": "49",
    "1104": "59",
    "1105": "maximum",
    "1106": "mutable",
    "1107": "98",
    "1108": "99",
    "1109": "109",
    "1110": "114",
    "1111": "strings,",
    "1112": "automatically",
    "1113": "205",
    "1114": "someone",
    "1115": "\ufb01gure",
    "1116": "operating",
    "1117": "helpful",
    "1118": "for.",
    "1119": "process.",
    "1120": "cpu",
    "1121": "turned",
    "1122": "easier",
    "1123": "word.",
    "1124": "walk",
    "1125": "likely",
    "1126": "double",
    "1127": "executing",
    "1128": "says",
    "1129": "powerful",
    "1130": "leave",
    "1131": "probably",
    "1132": "seems",
    "1133": "itself",
    "1134": "particularly",
    "1135": "task",
    "1136": "am",
    "1137": "words:",
    "1138": "together",
    "1139": "produce",
    "1140": "'hello",
    "1141": "logic",
    "1142": "another.",
    "1143": "semantic",
    "1144": "friend",
    "1145": "gives",
    "1146": "years",
    "1147": "short",
    "1148": "picture",
    "1149": "night",
    "1150": "speci\ufb01es",
    "1151": "displays",
    "1152": "4:",
    "1153": "wrong",
    "1154": "represent",
    "1155": "read,",
    "1156": "example:",
    "1157": "'",
    "1158": "10:",
    "1159": "e\ufb00ect",
    "1160": "reduce",
    "1161": "rate",
    "1162": "pay",
    "1163": "characters.",
    "1164": "performing",
    "1165": "executed.",
    "1166": "block",
    "1167": "0,",
    "1168": "branch",
    "1169": "on.",
    "1170": "outer",
    "1171": "fahrenheit",
    "1172": "repeatedly",
    "1173": "tells",
    "1174": "apply",
    "1175": "expression:",
    "1176": "none.",
    "1177": "current",
    "1178": "times.",
    "1179": "here\u2019s",
    "1180": "copies",
    "1181": "mark",
    "1182": "anything",
    "1183": "bracket",
    "1184": "brackets",
    "1185": "indices",
    "1186": "6.",
    "1187": "reason",
    "1188": "separate",
    "1189": "omit",
    "1190": "slicing",
    "1191": "traverse",
    "1192": "operation",
    "1193": "zqian@umich.edu",
    "1194": "cwen@iupui.edu",
    "1195": "systems",
    "1196": "brackets,",
    "1197": "'e',",
    "1198": "'f']",
    "1199": "append",
    "1200": "argument,",
    "1201": "'from'",
    "1202": "romeo.txt",
    "1203": "implement",
    "1204": "entries",
    "1205": "121",
    "1206": "11.",
    "1207": "returned",
    "1208": "applies",
    "1209": "matched",
    "1210": "grep",
    "1211": "pattern,",
    "1212": "12.",
    "1213": "port",
    "1214": "recv()",
    "1215": "connect",
    "1216": "bytes",
    "1217": "site",
    "1218": "14.",
    "1219": "an.party()",
    "1220": "cricketfan",
    "1221": "eye",
    "1222": "183",
    "1223": "('my",
    "1224": "(name,",
    "1225": "cur.execute('''insert",
    "1226": ")''',",
    "1227": "geocoding",
    "1228": "94,",
    "1229": "119,",
    "1230": "charles",
    "1231": "appendix",
    "1232": "je\ufb00",
    "1233": "perfect",
    "1234": "course,",
    "1235": "science",
    "1236": "topics",
    "1237": "presented",
    "1238": "interesting",
    "1239": "8",
    "1240": "possibly",
    "1241": "keywords",
    "1242": "22",
    "1243": "choosing",
    "1244": "chained",
    "1245": "conditionals",
    "1246": "51",
    "1247": "in\ufb01nite",
    "1248": "iterations",
    "1249": "68",
    "1250": "traversal",
    "1251": "slices",
    "1252": "97",
    "1253": "126",
    "1254": "131",
    "1255": "combining",
    "1256": "bonus",
    "1257": "157",
    "1258": "extensible",
    "1259": "larger",
    "1260": "181",
    "1261": "lookup",
    "1262": "192",
    "1263": "many-to-many",
    "1264": "207",
    "1265": "contributor",
    "1266": "solving",
    "1267": "speak",
    "1268": "kinds",
    "1269": "telling",
    "1270": "chapter.",
    "1271": "fact",
    "1272": "now,",
    "1273": "please",
    "1274": "skill",
    "1275": "turn",
    "1276": "developing",
    "1277": "devices",
    "1278": "amount",
    "1279": "talk",
    "1280": "o\ufb00.",
    "1281": "disk",
    "1282": "correct",
    "1283": "first,",
    "1284": "properly",
    "1285": "longer",
    "1286": "meaning",
    "1287": "python\u2019s",
    "1288": "window",
    "1289": "mode",
    "1290": "\u02c6",
    "1291": "proper",
    "1292": "interpreter,",
    "1293": "notice",
    "1294": "(2)",
    "1295": "term",
    "1296": "execution.",
    "1297": "stop",
    "1298": "spend",
    "1299": "better",
    "1300": "world!'",
    "1301": "order,",
    "1302": "fail",
    "1303": "step",
    "1304": "translating",
    "1305": "causes",
    "1306": "a)",
    "1307": "b)",
    "1308": "c)",
    "1309": "d)",
    "1310": "'str'>",
    "1311": "spaces",
    "1312": "error:",
    "1313": "message,",
    "1314": "refers",
    "1315": "illegal",
    "1316": "mode,",
    "1317": "output.",
    "1318": "combination",
    "1319": "mathematical",
    "1320": "\ufb01rst,",
    "1321": "happens",
    "1322": "yields",
    "1323": "called,",
    "1324": "input.",
    "1325": "newline,",
    "1326": "int",
    "1327": "velocity",
    "1328": "terms",
    "1329": "hours",
    "1330": "yet",
    "1331": "in,",
    "1332": "determine",
    "1333": "runtime",
    "1334": "prompts",
    "1335": "false.",
    "1336": "although",
    "1337": "and,",
    "1338": "limit",
    "1339": "nothing",
    "1340": "necessary",
    "1341": "provide",
    "1342": "message.",
    "1343": "points",
    "1344": "handles",
    "1345": "41",
    "1346": "argument.",
    "1347": "functions.",
    "1348": "computes",
    "1349": "generate",
    "1350": "random,",
    "1351": "lumberjack,",
    "1352": "sleep",
    "1353": "arguments.",
    "1354": "sense",
    "1355": "half",
    "1356": "local",
    "1357": "smaller",
    "1358": "passed",
    "1359": "exit",
    "1360": "sally",
    "1361": "41,",
    "1362": "12,",
    "1363": "increment",
    "1364": "enters",
    "1365": "count,",
    "1366": "fruit",
    "1367": "index.",
    "1368": "traverses",
    "1369": "sequence.",
    "1370": "existing",
    "1371": "original",
    "1372": "substrings",
    "1373": "startswith",
    "1374": "checking",
    "1375": "at:",
    "1376": "replace",
    "1377": "80",
    "1378": "7.",
    "1379": "open(fname)",
    "1380": "line)",
    "1381": "20,",
    "1382": "delimiter",
    "1383": "wrong!",
    "1384": "words[0]",
    "1385": "pairs",
    "1386": "dictionaries.",
    "1387": ",",
    "1388": "42,",
    "1389": "juliet",
    "1390": "sun",
    "1391": "counts:",
    "1392": "lst",
    "1393": "195",
    "1394": "val",
    "1395": "plus",
    "1396": "findall()",
    "1397": "non-blank",
    "1398": "de\ufb01nes",
    "1399": "character(s)",
    "1400": "wed,",
    "1401": "retrieved",
    "1402": "urllib.request,",
    "1403": "urllib.parse,",
    "1404": "urllib.error",
    "1405": "libraries",
    "1406": "anchor",
    "1407": "hotel",
    "1408": "constructor",
    "1409": "jim",
    "1410": "(title",
    "1411": "row.",
    "1412": "title,",
    "1413": "track;",
    "1414": "text);",
    "1415": "'frank",
    "1416": "\u201cmany\u201d",
    "1417": "rating",
    "1418": "album_id",
    "1419": "\"si106\"],",
    "1420": "\"si106\",",
    "1421": "203",
    "1422": "16.",
    "1423": "poland",
    "1424": "visualization",
    "1425": "chris",
    "1426": "47,",
    "1427": "97,",
    "1428": "dr.",
    "1429": "openstreetmap",
    "1430": "3.0",
    "1431": "conversion",
    "1432": "details",
    "1433": "license.",
    "1434": "told",
    "1435": "experiment",
    "1436": "others.",
    "1437": "people",
    "1438": "skills",
    "1439": "professional",
    "1440": "technology",
    "1441": "increasingly",
    "1442": "sophisticated",
    "1443": "rather",
    "1444": "removed",
    "1445": "tasks",
    "1446": "iv",
    "1447": "explore",
    "1448": "permission",
    "1449": "gnu",
    "1450": "follows",
    "1451": "feel",
    "1452": "program?",
    "1453": "21",
    "1454": "catching",
    "1455": "short-circuit",
    "1456": "flow",
    "1457": "60",
    "1458": "62",
    "1459": "69",
    "1460": "aliasing",
    "1461": "counters",
    "1462": "advanced",
    "1463": "comparing",
    "1464": "122",
    "1465": "132",
    "1466": "142",
    "1467": "hypertext",
    "1468": "transfer",
    "1469": "148",
    "1470": "152",
    "1471": "13",
    "1472": "nodes",
    "1473": "167",
    "1474": "169",
    "1475": "189",
    "1476": "191",
    "1477": "196",
    "1478": "200",
    "1479": "contributions",
    "1480": "di\ufb03cult",
    "1481": "care",
    "1482": "next?\u201d",
    "1483": "me!",
    "1484": "paragraphs",
    "1485": "commonly",
    "1486": "job",
    "1487": "encounter",
    "1488": "memory.",
    "1489": "advantage",
    "1490": "sense,",
    "1491": "act",
    "1492": "programming.",
    "1493": "vocabulary",
    "1494": "trying",
    "1495": "say,",
    "1496": "blah",
    "1497": "yield",
    "1498": "(in",
    "1499": "you.",
    "1500": "well.",
    "1501": "unless",
    "1502": "out.",
    "1503": "saw",
    "1504": "thought",
    "1505": "relatively",
    "1506": "(1)",
    "1507": "later.",
    "1508": "six",
    "1509": "system,",
    "1510": "executable",
    "1511": "respectively.",
    "1512": "marks",
    "1513": "itself.",
    "1514": "like:",
    "1515": "script,",
    "1516": "knows",
    "1517": "word,",
    "1518": "text.",
    "1519": "save",
    "1520": "exchange",
    "1521": "low-level",
    "1522": "constructs",
    "1523": "screen",
    "1524": "foot",
    "1525": "mean,",
    "1526": "primt",
    "1527": "there,",
    "1528": "try:",
    "1529": "last,",
    "1530": "forget",
    "1531": "big",
    "1532": "can\u2019t",
    "1533": "seem",
    "1534": "took",
    "1535": "de\ufb01ning",
    "1536": "learned",
    "1537": "di\ufb00erence",
    "1538": "belong",
    "1539": "(and",
    "1540": "quotation",
    "1541": "integers.",
    "1542": "numbers,",
    "1543": "features",
    "1544": "statement:",
    "1545": "use.",
    "1546": "computations",
    "1547": "addition",
    "1548": "expect",
    "1549": "evaluates",
    "1550": "evaluate",
    "1551": "precedence,",
    "1552": "divided",
    "1553": "%",
    "1554": "zero,",
    "1555": "performs",
    "1556": "user\u2019s",
    "1557": "unladen",
    "1558": "swallow?",
    "1559": "valueerror:",
    "1560": "assume",
    "1561": "level",
    "1562": "notion",
    "1563": "consists",
    "1564": "color",
    "1565": "far,",
    "1566": "hours:",
    "1567": "not.",
    "1568": "behavior",
    "1569": "condition.",
    "1570": "y:",
    "1571": "float(inp)",
    "1572": "fails",
    "1573": "purpose",
    "1574": "feature",
    "1575": "exception",
    "1576": "whitespace",
    "1577": "ignoring",
    "1578": "printed",
    "1579": "numeric",
    "1580": "0.0",
    "1581": "grade",
    "1582": "f",
    "1583": "de\ufb01nition.",
    "1584": "treat",
    "1585": "o\ufb00",
    "1586": "module,",
    "1587": "functions,",
    "1588": "called.",
    "1589": "print('i",
    "1590": "print_lyrics()",
    "1591": "50",
    "1592": "adds",
    "1593": "sum",
    "1594": "algorithm",
    "1595": "provided",
    "1596": "abc",
    "1597": "exist,",
    "1598": "print('done!')",
    "1599": "carefully",
    "1600": "'done':",
    "1601": "friends",
    "1602": "changing",
    "1603": "[3,",
    "1604": "74,",
    "1605": "items.",
    "1606": "(3,",
    "1607": "sequence,",
    "1608": "number,",
    "1609": "exact",
    "1610": "counter",
    "1611": "lower",
    "1612": "map",
    "1613": "portion",
    "1614": "work.",
    "1615": "date:",
    "1616": "2]",
    "1617": "\u201cfrom\u201d",
    "1618": "count:',",
    "1619": "includes",
    "1620": "\u201cfrom:\u201d,",
    "1621": "desired",
    "1622": "david.horwitz@uct.ac.za",
    "1623": "fname",
    "1624": "fname)",
    "1625": "\ufb01les.",
    "1626": "subject",
    "1627": "qa",
    "1628": "inserting",
    "1629": "representation",
    "1630": "x-dspam-confidence:",
    "1631": "[17,",
    "1632": "accessing",
    "1633": "element.",
    "1634": "t1",
    "1635": "modi\ufb01es",
    "1636": "equivalent,",
    "1637": "reference",
    "1638": "101",
    "1639": "removing",
    "1640": "6,",
    "1641": "pair",
    "1642": "9.",
    "1643": "moment",
    "1644": "yonder",
    "1645": "inner",
    "1646": "40,",
    "1647": "32,",
    "1648": "for,",
    "1649": "tuples.",
    "1650": "domain",
    "1651": "('a',",
    "1652": "(0,",
    "1653": "frequency",
    "1654": "directory",
    "1655": "line):",
    "1656": "easily",
    "1657": "wild",
    "1658": "non-whitespace",
    "1659": "len(x)",
    "1660": "connections",
    "1661": "sends",
    "1662": "request",
    "1663": "headers",
    "1664": "view",
    "1665": "requests",
    "1666": "library.",
    "1667": "page,",
    "1668": "153",
    "1669": "pages.",
    "1670": "based",
    "1671": "zip",
    "1672": "airline",
    "1673": "oauth",
    "1674": "j",
    "1675": "extending",
    "1676": "column.",
    "1677": "sqlite3",
    "1678": "\ufb01elds",
    "1679": "plays)",
    "1680": "cur.execute('select",
    "1681": "update,",
    "1682": "25,",
    "1683": "artist,",
    "1684": "('frank",
    "1685": "artist_id)",
    "1686": "normalization,",
    "1687": "sinatra|blue",
    "1688": "artists",
    "1689": "uniqueness",
    "1690": "197",
    "1691": "(user_id,",
    "1692": "si106",
    "1693": "developer",
    "1694": "rank,",
    "1695": "sprank.py",
    "1696": "spidering",
    "1697": "gmane.py",
    "1698": "license,",
    "1699": "david",
    "1700": "53,",
    "1701": "29,",
    "1702": "69,",
    "1703": "91,",
    "1704": "everybody",
    "1705": "severance",
    "1706": "apis",
    "1707": "complete",
    "1708": "licensed",
    "1709": "considers",
    "1710": "preface",
    "1711": "natural",
    "1712": "decided",
    "1713": "focused",
    "1714": "chosen",
    "1715": "direct",
    "1716": "outside",
    "1717": "all.",
    "1718": "computer,",
    "1719": "scraping",
    "1720": "covered",
    "1721": "books",
    "1722": "holder",
    "1723": "cc-by-sa",
    "1724": "materials",
    "1725": "downey",
    "1726": "press",
    "1727": "you,",
    "1728": "motivation",
    "1729": "blocks",
    "1730": "wrong?",
    "1731": "2.3",
    "1732": "v",
    "1733": "comments",
    "1734": "26",
    "1735": "27",
    "1736": "30",
    "1737": "de\ufb01nitions",
    "1738": "48",
    "1739": "52",
    "1740": "updating",
    "1741": "61",
    "1742": "67",
    "1743": "83",
    "1744": "letting",
    "1745": "102",
    "1746": "111",
    "1747": "112",
    "1748": "124",
    "1749": "sequences:",
    "1750": "158",
    "1751": "160",
    "1752": "161",
    "1753": "165",
    "1754": "168",
    "1755": "174",
    "1756": "instances",
    "1757": "inheritance",
    "1758": "multi-table",
    "1759": "geocoded",
    "1760": "networks",
    "1761": "interconnections",
    "1762": "217",
    "1763": "218",
    "1764": "219",
    "1765": "fun",
    "1766": "assistant",
    "1767": "talking",
    "1768": "human",
    "1769": "piece",
    "1770": "intended",
    "1771": "useful,",
    "1772": "others",
    "1773": "great",
    "1774": "software,",
    "1775": "develop",
    "1776": "etc.",
    "1777": "programmer,",
    "1778": "combine",
    "1779": "story",
    "1780": "languages.",
    "1781": "unlike",
    "1782": "sees",
    "1783": "variables.",
    "1784": "giving",
    "1785": "world!')",
    "1786": "syntactically",
    "1787": "sentence",
    "1788": "standard",
    "1789": "world!",
    "1790": "yourself,",
    "1791": "syntax.",
    "1792": "express",
    "1793": "nameerror:",
    "1794": "don't",
    "1795": "got",
    "1796": "more.",
    "1797": "computed",
    "1798": "though",
    "1799": "typing",
    "1800": "paragraph",
    "1801": "nature",
    "1802": "problems.",
    "1803": "convention,",
    "1804": "hello.py",
    "1805": "millions",
    "1806": "words.",
    "1807": "fully",
    "1808": "repeated",
    "1809": "one.",
    "1810": "leaves",
    "1811": "world')",
    "1812": "happy",
    "1813": "looked",
    "1814": "directions",
    "1815": "contained",
    "1816": "errors,",
    "1817": "begins",
    "1818": "\ufb01nding",
    "1819": "especially",
    "1820": "examine",
    "1821": "it:",
    "1822": "\ufb01x",
    "1823": "\ufb01t",
    "1824": "ok",
    "1825": "internet",
    "1826": "beyond",
    "1827": "6:",
    "1828": "with,",
    "1829": "'int'>",
    "1830": "str",
    "1831": "decimal",
    "1832": "well,",
    "1833": "that\u2019s",
    "1834": "integers,",
    "1835": "manipulate",
    "1836": "values:",
    "1837": "to.",
    "1838": "names.",
    "1839": "result,",
    "1840": "result:",
    "1841": "divide",
    "1842": "entered",
    "1843": "operators,",
    "1844": "remainder",
    "1845": "digit",
    "1846": "digits.",
    "1847": "int()",
    "1848": "int(speed)",
    "1849": "african",
    "1850": "european",
    "1851": "percentage",
    "1852": "comment",
    "1853": "follow",
    "1854": "identical",
    "1855": "etc.)",
    "1856": "clear",
    "1857": "truly",
    "1858": "operator:",
    "1859": "rate:",
    "1860": "won\u2019t",
    "1861": "temperature",
    "1862": "converted",
    "1863": "compares",
    "1864": "are:",
    "1865": "familiar",
    "1866": "operator.",
    "1867": "or,",
    "1868": "block.",
    "1869": "negative",
    "1870": "middle",
    "1871": "statements,",
    "1872": "otherwise",
    "1873": "execution,",
    "1874": "branches",
    "1875": "y')",
    "1876": "'a':",
    "1877": "37",
    "1878": "however",
    "1879": "ignored",
    "1880": "except:",
    "1881": "occurs",
    "1882": "regardless",
    "1883": "technique",
    "1884": "consider",
    "1885": "calculation",
    "1886": "whose",
    "1887": "worked",
    "1888": "0.6",
    "1889": "included",
    "1890": "min",
    "1891": "limited",
    "1892": "converts",
    "1893": "module.",
    "1894": "separated",
    "1895": "degrees",
    "1896": "pseudorandom",
    "1897": "high",
    "1898": "print_lyrics",
    "1899": "day.",
    "1900": "section,",
    "1901": "completes,",
    "1902": "michael",
    "1903": "capture",
    "1904": "development",
    "1905": "again.",
    "1906": "during",
    "1907": "initialize",
    "1908": "iteration.",
    "1909": "infinite",
    "1910": "constant",
    "1911": "explicitly",
    "1912": "line[0]",
    "1913": "'#':",
    "1914": "this!",
    "1915": "iteration,",
    "1916": "english",
    "1917": "15]:",
    "1918": "count)",
    "1919": "control",
    "1920": "far\u201d.",
    "1921": "debugging.",
    "1922": "zero.",
    "1923": "\u201ca\u201d",
    "1924": "letter.",
    "1925": "indexes",
    "1926": "indexerror:",
    "1927": "letter,",
    "1928": "word:",
    "1929": "72",
    "1930": "world'",
    "1931": "upper",
    "1932": "searches",
    "1933": "at-sign.",
    "1934": "curly",
    "1935": "value:",
    "1936": "spotted",
    "1937": "l",
    "1938": "return-path:",
    "1939": "sat,",
    "1940": "details:",
    "1941": "\ufb01le:",
    "1942": "directory:",
    "1943": "records",
    "1944": "messages.",
    "1945": "characters,",
    "1946": "louis@media.berkeley.edu",
    "1947": "rjlowe@iupui.edu",
    "1948": "fri",
    "1949": "edit",
    "1950": "search6.py",
    "1951": "team",
    "1952": "quality",
    "1953": "pythonic",
    "1954": "\u201cmore",
    "1955": "solution",
    "1956": "old",
    "1957": "returning",
    "1958": "default",
    "1959": "spaces,",
    "1960": "missing",
    "1961": "form:",
    "1962": "0.8475",
    "1963": "cheeses",
    "1964": "[]",
    "1965": "elements,",
    "1966": "t2",
    "1967": "t.sort()",
    "1968": "breaks",
    "1969": "individual",
    "1970": "\u201cfrom\u201d,",
    "1971": "print(words[2])",
    "1972": "split,",
    "1973": "x-dspam-probability:",
    "1974": "0.0000",
    "1975": "subset",
    "1976": "dict",
    "1977": "eng2sp",
    "1978": "indexed",
    "1979": "dictionaries,",
    "1980": "implementation",
    "1981": "d[c]",
    "1982": "histogram",
    "1983": "'chuck'",
    "1984": "'annie'",
    "1985": "'jan':",
    "1986": "100}",
    "1987": "compare",
    "1988": "romeo",
    "1989": "soft",
    "1990": "fair",
    "1991": "kill",
    "1992": "envious",
    "1993": "sick",
    "1994": "pale",
    "1995": "iterating",
    "1996": "+=",
    "1997": "print(key,",
    "1998": "described",
    "1999": "24,",
    "2000": "pair.",
    "2001": "tuple.",
    "2002": "reverse",
    "2003": "'have',",
    "2004": "'have'",
    "2005": "]",
    "2006": "'c':22}",
    "2007": "shape",
    "2008": "plain",
    "2009": "129",
    "2010": "complicated",
    "2011": "basics",
    "2012": "full",
    "2013": "\u201cgreedy\u201d",
    "2014": "greedy",
    "2015": "['cwen@iupui.edu']",
    "2016": "['source@collab.sakaiproject.org']",
    "2017": "\\s",
    "2018": "parser",
    "2019": "nicely",
    "2020": "tries",
    "2021": "period.",
    "2022": "re:",
    "2023": "describe",
    "2024": "receive",
    "2025": "pages,",
    "2026": "certificate",
    "2027": "ctx",
    "2028": "ssl.create_default_context()",
    "2029": "ctx.check_hostname",
    "2030": "ctx.verify_mode",
    "2031": "ssl.cert_none",
    "2032": "context=ctx).read()",
    "2033": "enforce",
    "2034": "https://www.python.org/",
    "2035": "xml,",
    "2036": "html.parser",
    "2037": "page.",
    "2038": "html,",
    "2039": "<name>chuck</name>",
    "2040": "734",
    "2041": "303",
    "2042": "tree",
    "2043": "13.",
    "2044": "'''",
    "2045": "<user",
    "2046": "</user>",
    "2047": "print('user",
    "2048": "count:",
    "2049": "}",
    "2050": "service-oriented",
    "2051": "soa",
    "2052": "contact",
    "2053": "performance",
    "2054": "design",
    "2055": "partyanimal:",
    "2056": "party(self)",
    "2057": "partyanimal()",
    "2058": "convention",
    "2059": "destructor",
    "2060": "self.points",
    "2061": "rows,",
    "2062": "row,",
    "2063": "courses",
    "2064": "conn",
    "2065": "cur",
    "2066": "conn.cursor()",
    "2067": "'my",
    "2068": "conn.commit()",
    "2069": "\u201ccrud\u201d",
    "2070": "15,",
    "2071": "('new",
    "2072": "york',",
    "2073": "sinatra",
    "2074": "model,",
    "2075": "(id",
    "2076": "\u2018frank",
    "2077": "sinatra\u2019",
    "2078": "pointing",
    "2079": "database,",
    "2080": "last_insert_rowid();",
    "2081": "))",
    "2082": "cur.fetchone()[0]",
    "2083": "\"si110\"],",
    "2084": "\"mea\",",
    "2085": "\"rosa\",",
    "2086": "\"si110\",",
    "2087": "loaded",
    "2088": "where.js",
    "2089": "voivodeship,",
    "2090": "where.html",
    "2091": "spidered",
    "2092": "[building",
    "2093": "gmodel.py",
    "2094": "->",
    "2095": "juan",
    "2096": "translation:",
    "2097": "sarah",
    "2098": "scientist.",
    "2099": "100,",
    "2100": "31,",
    "2101": "102,",
    "2102": "23,",
    "2103": "109,",
    "2104": "traversal,",
    "2105": "51,",
    "2106": "105,",
    "2107": "16,",
    "2108": "21,",
    "2109": "19,",
    "2110": "exploring",
    "2111": "cover",
    "2112": "history",
    "2113": "references",
    "2114": "switch",
    "2115": "commons",
    "2116": "scratch",
    "2117": "elkner,",
    "2118": "\ufb01fth",
    "2119": "algorithms",
    "2120": "goal",
    "2121": "handling",
    "2122": "happened",
    "2123": "break,",
    "2124": "he",
    "2125": "beginning.",
    "2126": "chapters",
    "2127": "replaced",
    "2128": "introduced",
    "2129": "early",
    "2130": "lesson",
    "2131": "user-de\ufb01ned",
    "2132": "new,",
    "2133": "network,",
    "2134": "informatics",
    "2135": "programmer.",
    "2136": "except,",
    "2137": "further",
    "2138": "thinking",
    "2139": "share",
    "2140": "maintains",
    "2141": "hope",
    "2142": "help,",
    "2143": "school",
    "2144": "information.",
    "2145": "1.5",
    "2146": "conversing",
    "2147": "terminology:",
    "2148": "journey",
    "2149": "2.9",
    "2150": "exceptions",
    "2151": "36",
    "2152": "finishing",
    "2153": "summing",
    "2154": "literals",
    "2155": "82",
    "2156": "try,",
    "2157": "87",
    "2158": "traversing",
    "2159": "deleting",
    "2160": "125",
    "2161": "comprehension",
    "2162": "140",
    "2163": "143",
    "2164": "145",
    "2165": "world\u2019s",
    "2166": "150",
    "2167": "151",
    "2168": "154",
    "2169": "159",
    "2170": "interfaces",
    "2171": "security",
    "2172": "usage",
    "2173": "subdividing",
    "2174": "171",
    "2175": "classes",
    "2176": "lifecycle",
    "2177": "175",
    "2178": "177",
    "2179": "178",
    "2180": "182",
    "2181": "185",
    "2182": "15.6",
    "2183": "diagrams",
    "2184": "190",
    "2185": "constraints",
    "2186": "translations",
    "2187": "220",
    "2188": "activity.",
    "2189": "helping",
    "2190": "personal",
    "2191": "digital",
    "2192": "amounts",
    "2193": "file:",
    "2194": "skilled",
    "2195": "suited",
    "2196": "bring",
    "2197": "programmers,",
    "2198": "clever",
    "2199": "different",
    "2200": "groups",
    "2201": "meet",
    "2202": "users,",
    "2203": "apart",
    "2204": "second.",
    "2205": "cpu.",
    "2206": "slower",
    "2207": "\ufb02ash",
    "2208": "usb",
    "2209": "portable",
    "2210": "network.",
    "2211": "helps",
    "2212": "art",
    "2213": "\u201cget",
    "2214": "dog,",
    "2215": "\u201ci",
    "2216": "suggest",
    "2217": "completely",
    "2218": "print('hello",
    "2219": "enclosed",
    "2220": "quotes.",
    "2221": "quotes",
    "2222": "quote",
    "2223": "macintosh",
    "2224": "ready",
    "2225": "planet",
    "2226": "inhabitants",
    "2227": "\u02c6\u02c6\u02c6\u02c6",
    "2228": "waiting",
    "2229": "'we",
    "2230": "1)",
    "2231": "chapters,",
    "2232": "defined",
    "2233": "quit()",
    "2234": "incorrect",
    "2235": "prompt.",
    "2236": "translators",
    "2237": "fall",
    "2238": "parses",
    "2239": "(a",
    "2240": "y.",
    "2241": "ordered",
    "2242": "above.",
    "2243": "puts",
    "2244": "c.",
    "2245": "onto",
    "2246": "system.",
    "2247": "answer",
    "2248": "something.",
    "2249": "easiest",
    "2250": "computing",
    "2251": "clown",
    "2252": "occurs.",
    "2253": "car",
    "2254": "imagine",
    "2255": "quicker",
    "2256": "scan",
    "2257": "came",
    "2258": "wrote",
    "2259": "bigcount",
    "2260": "techniques",
    "2261": "anyone",
    "2262": "structure,",
    "2263": "\u201coutside",
    "2264": "sequential",
    "2265": "conditions",
    "2266": "throughout",
    "2267": "sounds",
    "2268": "else,",
    "2269": "against",
    "2270": "perfectly",
    "2271": "help.",
    "2272": "library,",
    "2273": "steps",
    "2274": "do.",
    "2275": "reach",
    "2276": "gas",
    "2277": "bug,",
    "2278": "meant",
    "2279": "you\u2019re",
    "2280": "understand.",
    "2281": "bug",
    "2282": "reading,",
    "2283": "activity",
    "2284": "mode.",
    "2285": "thing.",
    "2286": "\ufb01nish",
    "2287": "pieces",
    "2288": "progress",
    "2289": "revisit",
    "2290": "away",
    "2291": "elegant",
