{
  ".": 1,
  "the": 2,
  "a": 3,
  "to": 4,
  "and": 5,
  "of": 6,
  "is": 7,
  "in": 8,
  "we": 9,
  "you": 10,
  "that": 11,
  "for": 12,
  "=": 13,
  "are": 14,
  "it": 15,
  "as": 16,
  ">>>": 17,
  "can": 18,
  "if": 19,
  "this": 20,
  "an": 21,
  "with": 22,
  "python": 23,
  "data": 24,
  "program": 25,
  "from": 26,
  "or": 27,
  "be": 28,
  "have": 29,
  "at": 30,
  "when": 31,
  "use": 32,
  "by": 33,
  "on": 34,
  "not": 35,
  "using": 36,
  "list": 37,
  "so": 38,
  "will": 39,
  "but": 40,
  "line": 41,
  "one": 42,
  "string": 43,
  "each": 44,
  "our": 45,
  "your": 46,
  "function": 47,
  "all": 48,
  "chapter": 49,
  "which": 50,
  "more": 51,
  "\ufb01le": 52,
  "there": 53,
  "loop": 54,
  "value": 55,
  "#": 56,
  "1": 57,
  "then": 58,
  "what": 59,
  "into": 60,
  "write": 61,
  "database": 62,
  "variable": 63,
  "lines": 64,
  "x": 65,
  "code": 66,
  "some": 67,
  "\ufb01rst": 68,
  "like": 69,
  "table": 70,
  "object": 71,
  "has": 72,
  "name": 73,
  "|": 74,
  "regular": 75,
  "called": 76,
  "where": 77,
  "they": 78,
  "two": 79,
  "number": 80,
  "want": 81,
  "2": 82,
  "values": 83,
  "same": 84,
  "print": 85,
  "see": 86,
  "these": 87,
  "many": 88,
  "do": 89,
  "read": 90,
  "i": 91,
  "how": 92,
  "get": 93,
  "because": 94,
  "following": 95,
  "out": 96,
  "characters": 97,
  "make": 98,
  "example,": 99,
  "call": 100,
  "new": 101,
  "user": 102,
  "count": 103,
  "enter": 104,
  "than": 105,
  "expression": 106,
  "through": 107,
  "while": 108,
  "statement": 109,
  "very": 110,
  "would": 111,
  "end": 112,
  "look": 113,
  "word": 114,
  "method": 115,
  "used": 116,
  "functions": 117,
  "file": 118,
  "other": 119,
  "time": 120,
  "web": 121,
  "words": 122,
  "character": 123,
  "language": 124,
  "create": 125,
  "any": 126,
  "text": 127,
  "key": 128,
  "also": 129,
  "most": 130,
  "need": 131,
  "code:": 132,
  "run": 133,
  "only": 134,
  "class": 135,
  "before": 136,
  "programs": 137,
  "was": 138,
  "us": 139,
  "might": 140,
  "start": 141,
  "between": 142,
  "statements": 143,
  "no": 144,
  "up": 145,
  "second": 146,
  "+": 147,
  "exercise": 148,
  "set": 149,
  "simple": 150,
  "1,": 151,
  "output": 152,
  "expressions": 153,
  "5": 154,
  "type": 155,
  "import": 156,
  "about": 157,
  "way": 158,
  "function,": 159,
  "track": 160,
  "follows:": 161,
  "its": 162,
  "0": 163,
  "could": 164,
  "sequence": 165,
  "syntax": 166,
  "index": 167,
  "example": 168,
  "3": 169,
  "programming": 170,
  "\ufb01nd": 171,
  "input": 172,
  "strings": 173,
  "tuples": 174,
  "should": 175,
  "take": 176,
  "add": 177,
  "error": 178,
  "y": 179,
  "try": 180,
  "lists": 181,
  "dictionary": 182,
  "another": 183,
  "does": 184,
  "operator": 185,
  "just": 186,
  "primary": 187,
  "simply": 188,
  "id": 189,
  "artist": 190,
  "di\ufb00erent": 191,
  "insert": 192,
  "match": 193,
  "\u2022": 194,
  "book": 195,
  "common": 196,
  "sql": 197,
  "know": 198,
  "single": 199,
  "returns": 200,
  "numbers": 201,
  "problem": 202,
  "don\u2019t": 203,
  "page": 204,
  ">": 205,
  "2,": 206,
  "search": 207,
  "-": 208,
  "over": 209,
  "logical": 210,
  "them": 211,
  "...": 212,
  "since": 213,
  "open": 214,
  "even": 215,
  "tuple": 216,
  "figure": 217,
  "followed": 218,
  "*": 219,
  ":": 220,
  "xml": 221,
  "debugging": 222,
  "glossary": 223,
  "methods": 224,
  "retrieve": 225,
  "looking": 226,
  "program.": 227,
  "something": 228,
  "their": 229,
  "think": 230,
  "been": 231,
  "exercises": 232,
  "learn": 233,
  "keys": 234,
  "application": 235,
  "memory": 236,
  "list.": 237,
  "order": 238,
  "names": 239,
  "elements": 240,
  "once": 241,
  "t": 242,
  "select": 243,
  "variables": 244,
  "special": 245,
  "true": 246,
  "after": 247,
  "next": 248,
  "letter": 249,
  "extract": 250,
  "within": 251,
  "element": 252,
  "computer": 253,
  "part": 254,
  "built-in": 255,
  "html": 256,
  "email": 257,
  "work": 258,
  "were": 259,
  "three": 260,
  "course": 261,
  "json": 262,
  "writing": 263,
  "b": 264,
  "both": 265,
  "much": 266,
  "integer": 267,
  "(": 268,
  "who": 269,
  "conditional": 270,
  "def": 271,
  "return": 272,
  "sqlite>": 273,
  "data.": 274,
  "execution": 275,
  "dictionaries": 276,
  "multiple": 277,
  "information": 278,
  "now": 279,
  "\ufb01le,": 280,
  "parsing": 281,
  "line.": 282,
  "interpreter": 283,
  "iteration": 284,
  "continue": 285,
  "assignment": 286,
  "program,": 287,
  "may": 288,
  "sometimes": 289,
  "break": 290,
  "name:": 291,
  "looks": 292,
  "list,": 293,
  "object.": 294,
  "uses": 295,
  "row": 296,
  "few": 297,
  "\ufb01les": 298,
  "often": 299,
  "contains": 300,
  "store": 301,
  "must": 302,
  "false": 303,
  "those": 304,
  "string,": 305,
  "last": 306,
  "here": 307,
  "empty": 308,
  "title": 309,
  "databases": 310,
  "instead": 311,
  "written": 312,
  "until": 313,
  "why": 314,
  "beautifulsoup": 315,
  "say": 316,
  "check": 317,
  "indicate": 318,
  "from:": 319,
  "key,": 320,
  "rows": 321,
  "such": 322,
  "pages": 323,
  "objects": 324,
  "above": 325,
  "takes": 326,
  "works": 327,
  "pattern": 328,
  "==": 329,
  "[": 330,
  "except": 331,
  "change": 332,
  "types": 333,
  "reading": 334,
  "good": 335,
  "already": 336,
  "string.": 337,
  "value.": 338,
  "method,": 339,
  "matches": 340,
  "socket": 341,
  "10": 342,
  "browser": 343,
  "command": 344,
  "construct": 345,
  "without": 346,
  "long": 347,
  "right": 348,
  "execute": 349,
  "integer,": 350,
  "named": 351,
  ")": 352,
  "statement.": 353,
  "<": 354,
  "argument": 355,
  "item": 356,
  "total": 357,
  "jan": 358,
  "fhand": 359,
  "sort": 360,
  "similar": 361,
  "documentation": 362,
  "loops": 363,
  "/": 364,
  "times": 365,
  "give": 366,
  "stored": 367,
  "\ufb01le.": 368,
  "avoid": 369,
  "unique": 370,
  "quite": 371,
  "contents": 372,
  "6": 373,
  "16": 374,
  "tables": 375,
  "sample": 376,
  "reserved": 377,
  "none": 378,
  "back": 379,
  "source": 380,
  "counts": 381,
  "document": 382,
  "sure": 383,
  "case": 384,
  "body": 385,
  "largest": 386,
  "parameter": 387,
  "stephen.marquard@uct.ac.za": 388,
  "examples": 389,
  "available": 390,
  "useful": 391,
  "4": 392,
  "29": 393,
  "random": 394,
  "urllib": 395,
  "understand": 396,
  "main": 397,
  "starts": 398,
  "smallest": 399,
  "indicates": 400,
  "statement,": 401,
  "expression,": 402,
  "condition": 403,
  "module": 404,
  "particular": 405,
  "column": 406,
  "my": 407,
  "object-oriented": 408,
  "operations": 409,
  "tell": 410,
  "processing": 411,
  "network": 412,
  "left": 413,
  "beginning": 414,
  "errors": 415,
  "makes": 416,
  "n": 417,
  ">=": 418,
  "items": 419,
  "open('mbox-short.txt')": 420,
  "['a',": 421,
  "'b',": 422,
  "handle": 423,
  "nested": 424,
  "100": 425,
  "mail": 426,
  "(or": 427,
  "put": 428,
  "messages": 429,
  "3,": 430,
  "slice": 431,
  "either": 432,
  "zero": 433,
  "table.": 434,
  "first": 435,
  "well": 436,
  "python.": 437,
  "possible": 438,
  "build": 439,
  "retrieving": 440,
  "visualizing": 441,
  "lot": 442,
  "python,": 443,
  "operators": 444,
  "32": 445,
  "45": 446,
  "files": 447,
  "programmers": 448,
  "machine": 449,
  "runs": 450,
  "process": 451,
  "')": 452,
  "download": 453,
  "(i.e.,": 454,
  "parse": 455,
  "prints": 456,
  "parentheses": 457,
  "allows": 458,
  "loop,": 459,
  "split": 460,
  "sorted": 461,
  "dictionary,": 462,
  "key-value": 463,
  "role": 464,
  "class.": 465,
  "always": 466,
  "quickly": 467,
  "go": 468,
  "40": 469,
  "53": 470,
  "128": 471,
  "extracting": 472,
  "applications": 473,
  "1.": 474,
  "software": 475,
  "secondary": 476,
  "keep": 477,
  "later": 478,
  "pass": 479,
  "invalid": 480,
  "refer": 481,
  "shown": 482,
  "little": 483,
  "result": 484,
  "<class": 485,
  "format": 486,
  "stuff": 487,
  "join": 488,
  "keyword": 489,
  "several": 490,
  "character.": 491,
  "url": 492,
  "ignore": 493,
  "(title,": 494,
  "foreign": 495,
  "never": 496,
  "me": 497,
  "include": 498,
  "15": 499,
  "adding": 500,
  "92": 501,
  "117": 502,
  "120": 503,
  "protocol": 504,
  "javascript": 505,
  "connection": 506,
  "computers": 507,
  "usually": 508,
  "high-level": 509,
  "parts": 510,
  "time.": 511,
  "point": 512,
  "appears": 513,
  "too": 514,
  "traceback": 515,
  "actual": 516,
  "far": 517,
  "convert": 518,
  "reads": 519,
  "it.": 520,
  "rules": 521,
  "less": 522,
  "produces": 523,
  "c": 524,
  "shows": 525,
  "added": 526,
  "loop.": 527,
  "output:": 528,
  "2008": 529,
  "newline": 530,
  "fhand:": 531,
  "re": 532,
  "5120": 533,
  "drop": 534,
  "member": 535,
  "version": 536,
  "university": 537,
  "running": 538,
  "book,": 539,
  "given": 540,
  "recent": 541,
  "making": 542,
  "length": 543,
  "94": 544,
  "users": 545,
  "http": 546,
  "services": 547,
  "api": 548,
  "sqlite": 549,
  "basic": 550,
  "model": 551,
  "best": 552,
  "going": 553,
  "complex": 554,
  "cannot": 555,
  "words,": 556,
  "equivalent": 557,
  "message": 558,
  "sign": 559,
  "1:": 560,
  "contain": 561,
  "letters": 562,
  "assigned": 563,
  "operator,": 564,
  "access": 565,
  "side": 566,
  "'banana'": 567,
  "find": 568,
  "sat": 569,
  "mbox-short.txt": 570,
  "line.rstrip()": 571,
  "dictionary.": 572,
  "server": 573,
  "attributes": 574,
  "text,": 575,
  "self.x": 576,
  "party": 577,
  "table,": 578,
  "columns": 579,
  "artist_id": 580,
  "update": 581,
  "structure": 582,
  "important": 583,
  "building": 584,
  "11": 585,
  "expressions,": 586,
  "boolean": 587,
  "calls": 588,
  "95": 589,
  "things": 590,
  "ask": 591,
  "perhaps": 592,
  "means": 593,
  "down": 594,
  "rest": 595,
  "least": 596,
  "time,": 597,
  "prompt": 598,
  "\"<stdin>\",": 599,
  "copy": 600,
  "allow": 601,
  "remember": 602,
  "42": 603,
  "bit": 604,
  "input('enter": 605,
  "17": 606,
  "large": 607,
  "doesn\u2019t": 608,
  "character,": 609,
  "name,": 610,
  "3.": 611,
  "header": 612,
  "function.": 613,
  "object,": 614,
  "spam": 615,
  "constructed": 616,
  "number:": 617,
  "09:14:16": 618,
  "exists": 619,
  "partyanimal": 620,
  "own": 621,
  "starting": 622,
  "learning": 623,
  "variables,": 624,
  "counting": 625,
  "getting": 626,
  "choose": 627,
  "solve": 628,
  "kind": 629,
  "instructions": 630,
  "power": 631,
  "form": 632,
  "actually": 633,
  "interactive": 634,
  "syntaxerror:": 635,
  "comes": 636,
  "really": 637,
  "inside": 638,
  "commands": 639,
  "code.": 640,
  "de\ufb01nition": 641,
  "cause": 642,
  "help": 643,
  "error,": 644,
  "previous": 645,
  "seen": 646,
  "creates": 647,
  "provides": 648,
  "de\ufb01ned": 649,
  "!=": 650,
  "blank": 651,
  "corresponding": 652,
  "calling": 653,
  "done": 654,
  "itervar": 655,
  "pull": 656,
  "mbox.txt": 657,
  "'c',": 658,
  "'c']": 659,
  "print(t)": 660,
  "110": 661,
  "...>": 662,
  "rank": 663,
  "printing": 664,
  "students": 665,
  "had": 666,
  "analysis": 667,
  "searching": 668,
  "across": 669,
  "creating": 670,
  "free": 671,
  "31": 672,
  "parameters": 673,
  "57": 674,
  "len": 675,
  "looping": 676,
  "76": 677,
  "7": 678,
  "123": 679,
  "lists,": 680,
  "notation": 681,
  "detail": 682,
  "system": 683,
  "hard": 684,
  "central": 685,
  "small": 686,
  "found": 687,
  "idea": 688,
  "test": 689,
  "come": 690,
  "(most": 691,
  "immediately": 692,
  "print(x)": 693,
  "statements.": 694,
  "display": 695,
  "top": 696,
  "delete": 697,
  "executed": 698,
  "2:": 699,
  "number.": 700,
  "strings.": 701,
  "2.": 702,
  "compute": 703,
  "ends": 704,
  "(x/y)": 705,
  "square": 706,
  "loop:": 707,
  "[1,": 708,
  "send": 709,
  "print(line)": 710,
  "hash": 711,
  "average": 712,
  "size": 713,
  "na": 714,
  "boo": 715,
  "tuples,": 716,
  "?": 717,
  "links": 718,
  "tags": 719,
  "attribute": 720,
  "15.": 721,
  "plays": 722,
  "constraint": 723,
  "material": 724,
  "teach": 725,
  "problems": 726,
  "nearly": 727,
  "appear": 728,
  "data,": 729,
  "pick": 730,
  "(e.g.,": 731,
  "programs?": 732,
  "44": 733,
  "46": 734,
  "47": 735,
  "patterns": 736,
  "64": 737,
  "105": 738,
  "127": 739,
  "matching": 740,
  "summary": 741,
  "image": 742,
  "started": 743,
  "concepts": 744,
  "python\u201d": 745,
  "\u201cwhat": 746,
  "easy": 747,
  "computer.": 748,
  "ways": 749,
  "place": 750,
  "pretty": 751,
  "variable.": 752,
  "it,": 753,
  "nice": 754,
  "last):": 755,
  "<module>": 756,
  "various": 757,
  "code,": 758,
  "created": 759,
  "four": 760,
  "entire": 761,
  "counts[word]": 762,
  "error.": 763,
  "approach": 764,
  "generally": 765,
  "5,": 766,
  "whether": 767,
  "represents": 768,
  "whole": 769,
  "values.": 770,
  "equal": 771,
  "print('x": 772,
  "colon": 773,
  "again,": 774,
  "clause": 775,
  "expression.": 776,
  "s": 777,
  "support": 778,
  "wanted": 779,
  "close": 780,
  "elements.": 781,
  "'d',": 782,
  "hand": 783,
  "plays,": 784,
  ");": 785,
  "rewrite": 786,
  "initial": 787,
  "license": 788,
  "networked": 789,
  "4.": 790,
  "structured": 791,
  "move": 792,
  "results": 793,
  "14": 794,
  "19": 795,
  "math": 796,
  "arguments": 797,
  "comparison": 798,
  "formatted": 799,
  "79": 800,
  "89": 801,
  "93": 802,
  "166": 803,
  "179": 804,
  "relationships": 805,
  "202": 806,
  "\u201cthink": 807,
  "built": 808,
  "designed": 809,
  "true,": 810,
  "unit": 811,
  "person": 812,
  "language.": 813,
  "programs,": 814,
  "hello": 815,
  "earlier": 816,
  "link": 817,
  "exactly": 818,
  "working": 819,
  "$": 820,
  "lets": 821,
  "interested": 822,
  "perform": 823,
  "skip": 824,
  "3:": 825,
  "integers": 826,
  "library": 827,
  "4,": 828,
  "8.": 829,
  "result.": 830,
  "base": 831,
  "end.": 832,
  "gets": 833,
  "chuck": 834,
  "assign": 835,
  "period": 836,
  "bad": 837,
  "greater": 838,
  "\ufb02ow": 839,
  "score": 840,
  "score:": 841,
  "dot": 842,
  "\ufb01nds": 843,
  "3]": 844,
  "debug": 845,
  "still": 846,
  "position": 847,
  "range": 848,
  "line,": 849,
  "value,": 850,
  "instance": 851,
  "note": 852,
  "lines.": 853,
  "modify": 854,
  "list:": 855,
  "relationship": 856,
  "sent": 857,
  "tuple,": 858,
  "hand:": 859,
  "parent": 860,
  "class,": 861,
  "database.": 862,
  "album": 863,
  "course_id": 864,
  "restart": 865,
  "remove": 866,
  "google": 867,
  "copyright": 868,
  "creative": 869,
  "b.": 870,
  "instead,": 871,
  "focus": 872,
  "doing": 873,
  "needed": 874,
  "programming,": 875,
  "language,": 876,
  "become": 877,
  "able": 878,
  "minimum": 879,
  "architecture": 880,
  "23": 881,
  "24": 882,
  "mnemonic": 883,
  "28": 884,
  "evaluation": 885,
  "58": 886,
  "immutable": 887,
  "74": 888,
  "section": 889,
  "unix": 890,
  "simplest": 891,
  "modeling": 892,
  "187": 893,
  "fast": 894,
  "having": 895,
  "else": 896,
  "needs": 897,
  "next?": 898,
  "programs.": 899,
  "memory,": 900,
  "is,": 901,
  "elif": 902,
  "thing": 903,
  "(which": 904,
  "let\u2019s": 905,
  "made": 906,
  "mistake": 907,
  "languages": 908,
  "order.": 909,
  "translate": 910,
  "translated": 911,
  "editor": 912,
  "dict()": 913,
  "sequences": 914,
  "capabilities": 915,
  "stores": 916,
  "ability": 917,
  "lowercase": 918,
  "executes": 919,
  "division": 920,
  "5.": 921,
  "digits": 922,
  "stops": 923,
  "space": 924,
  "numbers.": 925,
  "this:": 926,
  "else:": 927,
  "goes": 928,
  "guardian": 929,
  "1.0,": 930,
  "d": 931,
  "de\ufb01ne": 932,
  "specify": 933,
  "i'm": 934,
  "objects.": 935,
  "show": 936,
  "runs,": 937,
  "index,": 938,
  "address": 939,
  "method.": 940,
  "slice,": 941,
  "structures": 942,
  "lists.": 943,
  "element,": 944,
  "{": 945,
  "type,": 946,
  "expressions.": 947,
  "gmt": 948,
  "ssl": 949,
  "tag": 950,
  "spider": 951,
  "service": 952,
  "tables.": 953,
  "eyes)": 954,
  "'blue');": 955,
  "one-to-many": 956,
  "user_id": 957,
  "70,": 958,
  "92,": 959,
  "76,": 960,
  "understanding": 961,
  "book.": 962,
  "overall": 963,
  "changes": 964,
  "additional": 965,
  "general": 966,
  "reuse": 967,
  "thank": 968,
  "9,": 969,
  "hardware": 970,
  "12": 971,
  "asking": 972,
  "alternative": 973,
  "34": 974,
  "43": 975,
  "fruitful": 976,
  "void": 977,
  "70": 978,
  "71": 979,
  "opening": 980,
  "86": 981,
  "88": 982,
  "91": 983,
  "9": 984,
  "119": 985,
  "linux": 986,
  "binary": 987,
  "markup": 988,
  "problem.": 989,
  "explain": 990,
  "humans": 991,
  "almost": 992,
  "(the": 993,
  "directly": 994,
  "programmer": 995,
  "per": 996,
  "point,": 997,
  "becomes": 998,
  "del": 999,
  "every": 1000,
  "conversation": 1001,
  "did": 1002,
  "communicate": 1003,
  "literal": 1004,
  "represented": 1005,
  "resulting": 1006,
  "script": 1007,
  "line.split()": 1008,
  "them.": 1009,
  "again": 1010,
  "computation": 1011,
  "5:": 1012,
  "assigns": 1013,
  "third": 1014,
  "variable,": 1015,
  "uppercase": 1016,
  "begin": 1017,
  "name.": 1018,
  "turns": 1019,
  "being": 1020,
  "values,": 1021,
  "evaluated": 1022,
  "m": 1023,
  "inp": 1024,
  "hour": 1025,
  "case,": 1026,
  "line:": 1027,
  "choice": 1028,
  "\ufb02oating-point": 1029,
  "10.": 1030,
  "indented": 1031,
  "false,": 1032,
  "yes": 1033,
  "compound": 1034,
  "0:": 1035,
  "executes,": 1036,
  "general,": 1037,
  "tracks": 1038,
  "program:": 1039,
  "type.": 1040,
  "string:": 1041,
  "matter": 1042,
  "zap": 1043,
  "\ufb01ve": 1044,
  "true:": 1045,
  "',": 1046,
  "none,": 1047,
  "this,": 1048,
  "assignment,": 1049,
  "alphabetical": 1050,
  "dir": 1051,
  "optional": 1052,
  "\ufb01les,": 1053,
  "lines,": 1054,
  "simpler": 1055,
  "eyes": 1056,
  "list()": 1057,
  "day": 1058,
  "mapping": 1059,
  "maps": 1060,
  "tables,": 1061,
  "key.": 1062,
  "entry": 1063,
  "enough": 1064,
  "preceding": 1065,
  "'fun'": 1066,
  "(1,": 1067,
  "addresses": 1068,
  "real": 1069,
  "documents": 1070,
  "web.": 1071,
  "retrieves": 1072,
  "keyword,": 1073,
  "child": 1074,
  "relational": 1075,
  "cursor": 1076,
  "way',": 1077,
  "sinatra',": 1078,
  "artist;": 1079,
  "?,": 1080,
  "si110": 1081,
  "0],": 1082,
  "visualize": 1083,
  "sakai": 1084,
  "content.sqlite": 1085,
  "67,": 1086,
  "68,": 1087,
  "under": 1088,
  "allen": 1089,
  "his": 1090,
  "series": 1091,
  "light": 1092,
  "including": 1093,
  "query": 1094,
  "around": 1095,
  "sentences": 1096,
  "compiler": 1097,
  "20": 1098,
  "operands": 1099,
  "modulus": 1100,
  "25": 1101,
  "35": 1102,
  "49": 1103,
  "59": 1104,
  "maximum": 1105,
  "mutable": 1106,
  "98": 1107,
  "99": 1108,
  "109": 1109,
  "114": 1110,
  "strings,": 1111,
  "automatically": 1112,
  "205": 1113,
  "someone": 1114,
  "\ufb01gure": 1115,
  "operating": 1116,
  "helpful": 1117,
  "for.": 1118,
  "process.": 1119,
  "cpu": 1120,
  "turned": 1121,
  "easier": 1122,
  "word.": 1123,
  "walk": 1124,
  "likely": 1125,
  "double": 1126,
  "executing": 1127,
  "says": 1128,
  "powerful": 1129,
  "leave": 1130,
  "probably": 1131,
  "seems": 1132,
  "itself": 1133,
  "particularly": 1134,
  "task": 1135,
  "am": 1136,
  "words:": 1137,
  "together": 1138,
  "produce": 1139,
  "'hello": 1140,
  "logic": 1141,
  "another.": 1142,
  "semantic": 1143,
  "friend": 1144,
  "gives": 1145,
  "years": 1146,
  "short": 1147,
  "picture": 1148,
  "night": 1149,
  "speci\ufb01es": 1150,
  "displays": 1151,
  "4:": 1152,
  "wrong": 1153,
  "represent": 1154,
  "read,": 1155,
  "example:": 1156,
  "'": 1157,
  "10:": 1158,
  "e\ufb00ect": 1159,
  "reduce": 1160,
  "rate": 1161,
  "pay": 1162,
  "characters.": 1163,
  "performing": 1164,
  "executed.": 1165,
  "block": 1166,
  "0,": 1167,
  "branch": 1168,
  "on.": 1169,
  "outer": 1170,
  "fahrenheit": 1171,
  "repeatedly": 1172,
  "tells": 1173,
  "apply": 1174,
  "expression:": 1175,
  "none.": 1176,
  "current": 1177,
  "times.": 1178,
  "here\u2019s": 1179,
  "copies": 1180,
  "mark": 1181,
  "anything": 1182,
  "bracket": 1183,
  "brackets": 1184,
  "indices": 1185,
  "6.": 1186,
  "reason": 1187,
  "separate": 1188,
  "omit": 1189,
  "slicing": 1190,
  "traverse": 1191,
  "operation": 1192,
  "zqian@umich.edu": 1193,
  "cwen@iupui.edu": 1194,
  "systems": 1195,
  "brackets,": 1196,
  "'e',": 1197,
  "'f']": 1198,
  "append": 1199,
  "argument,": 1200,
  "'from'": 1201,
  "romeo.txt": 1202,
  "implement": 1203,
  "entries": 1204,
  "121": 1205,
  "11.": 1206,
  "returned": 1207,
  "applies": 1208,
  "matched": 1209,
  "grep": 1210,
  "pattern,": 1211,
  "12.": 1212,
  "port": 1213,
  "recv()": 1214,
  "connect": 1215,
  "bytes": 1216,
  "site": 1217,
  "14.": 1218,
  "an.party()": 1219,
  "cricketfan": 1220,
  "eye": 1221,
  "183": 1222,
  "('my": 1223,
  "(name,": 1224,
  "cur.execute('''insert": 1225,
  ")''',": 1226,
  "geocoding": 1227,
  "94,": 1228,
  "119,": 1229,
  "charles": 1230,
  "appendix": 1231,
  "je\ufb00": 1232,
  "perfect": 1233,
  "course,": 1234,
  "science": 1235,
  "topics": 1236,
  "presented": 1237,
  "interesting": 1238,
  "8": 1239,
  "possibly": 1240,
  "keywords": 1241,
  "22": 1242,
  "choosing": 1243,
  "chained": 1244,
  "conditionals": 1245,
  "51": 1246,
  "in\ufb01nite": 1247,
  "iterations": 1248,
  "68": 1249,
  "traversal": 1250,
  "slices": 1251,
  "97": 1252,
  "126": 1253,
  "131": 1254,
  "combining": 1255,
  "bonus": 1256,
  "157": 1257,
  "extensible": 1258,
  "larger": 1259,
  "181": 1260,
  "lookup": 1261,
  "192": 1262,
  "many-to-many": 1263,
  "207": 1264,
  "contributor": 1265,
  "solving": 1266,
  "speak": 1267,
  "kinds": 1268,
  "telling": 1269,
  "chapter.": 1270,
  "fact": 1271,
  "now,": 1272,
  "please": 1273,
  "skill": 1274,
  "turn": 1275,
  "developing": 1276,
  "devices": 1277,
  "amount": 1278,
  "talk": 1279,
  "o\ufb00.": 1280,
  "disk": 1281,
  "correct": 1282,
  "first,": 1283,
  "properly": 1284,
  "longer": 1285,
  "meaning": 1286,
  "python\u2019s": 1287,
  "window": 1288,
  "mode": 1289,
  "\u02c6": 1290,
  "proper": 1291,
  "interpreter,": 1292,
  "notice": 1293,
  "(2)": 1294,
  "term": 1295,
  "execution.": 1296,
  "stop": 1297,
  "spend": 1298,
  "better": 1299,
  "world!'": 1300,
  "order,": 1301,
  "fail": 1302,
  "step": 1303,
  "translating": 1304,
  "causes": 1305,
  "a)": 1306,
  "b)": 1307,
  "c)": 1308,
  "d)": 1309,
  "'str'>": 1310,
  "spaces": 1311,
  "error:": 1312,
  "message,": 1313,
  "refers": 1314,
  "illegal": 1315,
  "mode,": 1316,
  "output.": 1317,
  "combination": 1318,
  "mathematical": 1319,
  "\ufb01rst,": 1320,
  "happens": 1321,
  "yields": 1322,
  "called,": 1323,
  "input.": 1324,
  "newline,": 1325,
  "int": 1326,
  "velocity": 1327,
  "terms": 1328,
  "hours": 1329,
  "yet": 1330,
  "in,": 1331,
  "determine": 1332,
  "runtime": 1333,
  "prompts": 1334,
  "false.": 1335,
  "although": 1336,
  "and,": 1337,
  "limit": 1338,
  "nothing": 1339,
  "necessary": 1340,
  "provide": 1341,
  "message.": 1342,
  "points": 1343,
  "handles": 1344,
  "41": 1345,
  "argument.": 1346,
  "functions.": 1347,
  "computes": 1348,
  "generate": 1349,
  "random,": 1350,
  "lumberjack,": 1351,
  "sleep": 1352,
  "arguments.": 1353,
  "sense": 1354,
  "half": 1355,
  "local": 1356,
  "smaller": 1357,
  "passed": 1358,
  "exit": 1359,
  "sally": 1360,
  "41,": 1361,
  "12,": 1362,
  "increment": 1363,
  "enters": 1364,
  "count,": 1365,
  "fruit": 1366,
  "index.": 1367,
  "traverses": 1368,
  "sequence.": 1369,
  "existing": 1370,
  "original": 1371,
  "substrings": 1372,
  "startswith": 1373,
  "checking": 1374,
  "at:": 1375,
  "replace": 1376,
  "80": 1377,
  "7.": 1378,
  "open(fname)": 1379,
  "line)": 1380,
  "20,": 1381,
  "delimiter": 1382,
  "wrong!": 1383,
  "words[0]": 1384,
  "pairs": 1385,
  "dictionaries.": 1386,
  ",": 1387,
  "42,": 1388,
  "juliet": 1389,
  "sun": 1390,
  "counts:": 1391,
  "lst": 1392,
  "195": 1393,
  "val": 1394,
  "plus": 1395,
  "findall()": 1396,
  "non-blank": 1397,
  "de\ufb01nes": 1398,
  "character(s)": 1399,
  "wed,": 1400,
  "retrieved": 1401,
  "urllib.request,": 1402,
  "urllib.parse,": 1403,
  "urllib.error": 1404,
  "libraries": 1405,
  "anchor": 1406,
  "hotel": 1407,
  "constructor": 1408,
  "jim": 1409,
  "(title": 1410,
  "row.": 1411,
  "title,": 1412,
  "track;": 1413,
  "text);": 1414,
  "'frank": 1415,
  "\u201cmany\u201d": 1416,
  "rating": 1417,
  "album_id": 1418,
  "\"si106\"],": 1419,
  "\"si106\",": 1420,
  "203": 1421,
  "16.": 1422,
  "poland": 1423,
  "visualization": 1424,
  "chris": 1425,
  "47,": 1426,
  "97,": 1427,
  "dr.": 1428,
  "openstreetmap": 1429,
  "3.0": 1430,
  "conversion": 1431,
  "details": 1432,
  "license.": 1433,
  "told": 1434,
  "experiment": 1435,
  "others.": 1436,
  "people": 1437,
  "skills": 1438,
  "professional": 1439,
  "technology": 1440,
  "increasingly": 1441,
  "sophisticated": 1442,
  "rather": 1443,
  "removed": 1444,
  "tasks": 1445,
  "iv": 1446,
  "explore": 1447,
  "permission": 1448,
  "gnu": 1449,
  "follows": 1450,
  "feel": 1451,
  "program?": 1452,
  "21": 1453,
  "catching": 1454,
  "short-circuit": 1455,
  "flow": 1456,
  "60": 1457,
  "62": 1458,
  "69": 1459,
  "aliasing": 1460,
  "counters": 1461,
  "advanced": 1462,
  "comparing": 1463,
  "122": 1464,
  "132": 1465,
  "142": 1466,
  "hypertext": 1467,
  "transfer": 1468,
  "148": 1469,
  "152": 1470,
  "13": 1471,
  "nodes": 1472,
  "167": 1473,
  "169": 1474,
  "189": 1475,
  "191": 1476,
  "196": 1477,
  "200": 1478,
  "contributions": 1479,
  "di\ufb03cult": 1480,
  "care": 1481,
  "next?\u201d": 1482,
  "me!": 1483,
  "paragraphs": 1484,
  "commonly": 1485,
  "job": 1486,
  "encounter": 1487,
  "memory.": 1488,
  "advantage": 1489,
  "sense,": 1490,
  "act": 1491,
  "programming.": 1492,
  "vocabulary": 1493,
  "trying": 1494,
  "say,": 1495,
  "blah": 1496,
  "yield": 1497,
  "(in": 1498,
  "you.": 1499,
  "well.": 1500,
  "unless": 1501,
  "out.": 1502,
  "saw": 1503,
  "thought": 1504,
  "relatively": 1505,
  "(1)": 1506,
  "later.": 1507,
  "six": 1508,
  "system,": 1509,
  "executable": 1510,
  "respectively.": 1511,
  "marks": 1512,
  "itself.": 1513,
  "like:": 1514,
  "script,": 1515,
  "knows": 1516,
  "word,": 1517,
  "text.": 1518,
  "save": 1519,
  "exchange": 1520,
  "low-level": 1521,
  "constructs": 1522,
  "screen": 1523,
  "foot": 1524,
  "mean,": 1525,
  "primt": 1526,
  "there,": 1527,
  "try:": 1528,
  "last,": 1529,
  "forget": 1530,
  "big": 1531,
  "can\u2019t": 1532,
  "seem": 1533,
  "took": 1534,
  "de\ufb01ning": 1535,
  "learned": 1536,
  "di\ufb00erence": 1537,
  "belong": 1538,
  "(and": 1539,
  "quotation": 1540,
  "integers.": 1541,
  "numbers,": 1542,
  "features": 1543,
  "statement:": 1544,
  "use.": 1545,
  "computations": 1546,
  "addition": 1547,
  "expect": 1548,
  "evaluates": 1549,
  "evaluate": 1550,
  "precedence,": 1551,
  "divided": 1552,
  "%": 1553,
  "zero,": 1554,
  "performs": 1555,
  "user\u2019s": 1556,
  "unladen": 1557,
  "swallow?": 1558,
  "valueerror:": 1559,
  "assume": 1560,
  "level": 1561,
  "notion": 1562,
  "consists": 1563,
  "color": 1564,
  "far,": 1565,
  "hours:": 1566,
  "not.": 1567,
  "behavior": 1568,
  "condition.": 1569,
  "y:": 1570,
  "float(inp)": 1571,
  "fails": 1572,
  "purpose": 1573,
  "feature": 1574,
  "exception": 1575,
  "whitespace": 1576,
  "ignoring": 1577,
  "printed": 1578,
  "numeric": 1579,
  "0.0": 1580,
  "grade": 1581,
  "f": 1582,
  "de\ufb01nition.": 1583,
  "treat": 1584,
  "o\ufb00": 1585,
  "module,": 1586,
  "functions,": 1587,
  "called.": 1588,
  "print('i": 1589,
  "print_lyrics()": 1590,
  "50": 1591,
  "adds": 1592,
  "sum": 1593,
  "algorithm": 1594,
  "provided": 1595,
  "abc": 1596,
  "exist,": 1597,
  "print('done!')": 1598,
  "carefully": 1599,
  "'done':": 1600,
  "friends": 1601,
  "changing": 1602,
  "[3,": 1603,
  "74,": 1604,
  "items.": 1605,
  "(3,": 1606,
  "sequence,": 1607,
  "number,": 1608,
  "exact": 1609,
  "counter": 1610,
  "lower": 1611,
  "map": 1612,
  "portion": 1613,
  "work.": 1614,
  "date:": 1615,
  "2]": 1616,
  "\u201cfrom\u201d": 1617,
  "count:',": 1618,
  "includes": 1619,
  "\u201cfrom:\u201d,": 1620,
  "desired": 1621,
  "david.horwitz@uct.ac.za": 1622,
  "fname": 1623,
  "fname)": 1624,
  "\ufb01les.": 1625,
  "subject": 1626,
  "qa": 1627,
  "inserting": 1628,
  "representation": 1629,
  "x-dspam-confidence:": 1630,
  "[17,": 1631,
  "accessing": 1632,
  "element.": 1633,
  "t1": 1634,
  "modi\ufb01es": 1635,
  "equivalent,": 1636,
  "reference": 1637,
  "101": 1638,
  "removing": 1639,
  "6,": 1640,
  "pair": 1641,
  "9.": 1642,
  "moment": 1643,
  "yonder": 1644,
  "inner": 1645,
  "40,": 1646,
  "32,": 1647,
  "for,": 1648,
  "tuples.": 1649,
  "domain": 1650,
  "('a',": 1651,
  "(0,": 1652,
  "frequency": 1653,
  "directory": 1654,
  "line):": 1655,
  "easily": 1656,
  "wild": 1657,
  "non-whitespace": 1658,
  "len(x)": 1659,
  "connections": 1660,
  "sends": 1661,
  "request": 1662,
  "headers": 1663,
  "view": 1664,
  "requests": 1665,
  "library.": 1666,
  "page,": 1667,
  "153": 1668,
  "pages.": 1669,
  "based": 1670,
  "zip": 1671,
  "airline": 1672,
  "oauth": 1673,
  "j": 1674,
  "extending": 1675,
  "column.": 1676,
  "sqlite3": 1677,
  "\ufb01elds": 1678,
  "plays)": 1679,
  "cur.execute('select": 1680,
  "update,": 1681,
  "25,": 1682,
  "artist,": 1683,
  "('frank": 1684,
  "artist_id)": 1685,
  "normalization,": 1686,
  "sinatra|blue": 1687,
  "artists": 1688,
  "uniqueness": 1689,
  "197": 1690,
  "(user_id,": 1691,
  "si106": 1692,
  "developer": 1693,
  "rank,": 1694,
  "sprank.py": 1695,
  "spidering": 1696,
  "gmane.py": 1697,
  "license,": 1698,
  "david": 1699,
  "53,": 1700,
  "29,": 1701,
  "69,": 1702,
  "91,": 1703,
  "everybody": 1704,
  "severance": 1705,
  "apis": 1706,
  "complete": 1707,
  "licensed": 1708,
  "considers": 1709,
  "preface": 1710,
  "natural": 1711,
  "decided": 1712,
  "focused": 1713,
  "chosen": 1714,
  "direct": 1715,
  "outside": 1716,
  "all.": 1717,
  "computer,": 1718,
  "scraping": 1719,
  "covered": 1720,
  "books": 1721,
  "holder": 1722,
  "cc-by-sa": 1723,
  "materials": 1724,
  "downey": 1725,
  "press": 1726,
  "you,": 1727,
  "motivation": 1728,
  "blocks": 1729,
  "wrong?": 1730,
  "2.3": 1731,
  "v": 1732,
  "comments": 1733,
  "26": 1734,
  "27": 1735,
  "30": 1736,
  "de\ufb01nitions": 1737,
  "48": 1738,
  "52": 1739,
  "updating": 1740,
  "61": 1741,
  "67": 1742,
  "83": 1743,
  "letting": 1744,
  "102": 1745,
  "111": 1746,
  "112": 1747,
  "124": 1748,
  "sequences:": 1749,
  "158": 1750,
  "160": 1751,
  "161": 1752,
  "165": 1753,
  "168": 1754,
  "174": 1755,
  "instances": 1756,
  "inheritance": 1757,
  "multi-table": 1758,
  "geocoded": 1759,
  "networks": 1760,
  "interconnections": 1761,
  "217": 1762,
  "218": 1763,
  "219": 1764,
  "fun": 1765,
  "assistant": 1766,
  "talking": 1767,
  "human": 1768,
  "piece": 1769,
  "intended": 1770,
  "useful,": 1771,
  "others": 1772,
  "great": 1773,
  "software,": 1774,
  "develop": 1775,
  "etc.": 1776,
  "programmer,": 1777,
  "combine": 1778,
  "story": 1779,
  "languages.": 1780,
  "unlike": 1781,
  "sees": 1782,
  "variables.": 1783,
  "giving": 1784,
  "world!')": 1785,
  "syntactically": 1786,
  "sentence": 1787,
  "standard": 1788,
  "world!": 1789,
  "yourself,": 1790,
  "syntax.": 1791,
  "express": 1792,
  "nameerror:": 1793,
  "don't": 1794,
  "got": 1795,
  "more.": 1796,
  "computed": 1797,
  "though": 1798,
  "typing": 1799,
  "paragraph": 1800,
  "nature": 1801,
  "problems.": 1802,
  "convention,": 1803,
  "hello.py": 1804,
  "millions": 1805,
  "words.": 1806,
  "fully": 1807,
  "repeated": 1808,
  "one.": 1809,
  "leaves": 1810,
  "world')": 1811,
  "happy": 1812,
  "looked": 1813,
  "directions": 1814,
  "contained": 1815,
  "errors,": 1816,
  "begins": 1817,
  "\ufb01nding": 1818,
  "especially": 1819,
  "examine": 1820,
  "it:": 1821,
  "\ufb01x": 1822,
  "\ufb01t": 1823,
  "ok": 1824,
  "internet": 1825,
  "beyond": 1826,
  "6:": 1827,
  "with,": 1828,
  "'int'>": 1829,
  "str": 1830,
  "decimal": 1831,
  "well,": 1832,
  "that\u2019s": 1833,
  "integers,": 1834,
  "manipulate": 1835,
  "values:": 1836,
  "to.": 1837,
  "names.": 1838,
  "result,": 1839,
  "result:": 1840,
  "divide": 1841,
  "entered": 1842,
  "operators,": 1843,
  "remainder": 1844,
  "digit": 1845,
  "digits.": 1846,
  "int()": 1847,
  "int(speed)": 1848,
  "african": 1849,
  "european": 1850,
  "percentage": 1851,
  "comment": 1852,
  "follow": 1853,
  "identical": 1854,
  "etc.)": 1855,
  "clear": 1856,
  "truly": 1857,
  "operator:": 1858,
  "rate:": 1859,
  "won\u2019t": 1860,
  "temperature": 1861,
  "converted": 1862,
  "compares": 1863,
  "are:": 1864,
  "familiar": 1865,
  "operator.": 1866,
  "or,": 1867,
  "block.": 1868,
  "negative": 1869,
  "middle": 1870,
  "statements,": 1871,
  "otherwise": 1872,
  "execution,": 1873,
  "branches": 1874,
  "y')": 1875,
  "'a':": 1876,
  "37": 1877,
  "however": 1878,
  "ignored": 1879,
  "except:": 1880,
  "occurs": 1881,
  "regardless": 1882,
  "technique": 1883,
  "consider": 1884,
  "calculation": 1885,
  "whose": 1886,
  "worked": 1887,
  "0.6": 1888,
  "included": 1889,
  "min": 1890,
  "limited": 1891,
  "converts": 1892,
  "module.": 1893,
  "separated": 1894,
  "degrees": 1895,
  "pseudorandom": 1896,
  "high": 1897,
  "print_lyrics": 1898,
  "day.": 1899,
  "section,": 1900,
  "completes,": 1901,
  "michael": 1902,
  "capture": 1903,
  "development": 1904,
  "again.": 1905,
  "during": 1906,
  "initialize": 1907,
  "iteration.": 1908,
  "infinite": 1909,
  "constant": 1910,
  "explicitly": 1911,
  "line[0]": 1912,
  "'#':": 1913,
  "this!": 1914,
  "iteration,": 1915,
  "english": 1916,
  "15]:": 1917,
  "count)": 1918,
  "control": 1919,
  "far\u201d.": 1920,
  "debugging.": 1921,
  "zero.": 1922,
  "\u201ca\u201d": 1923,
  "letter.": 1924,
  "indexes": 1925,
  "indexerror:": 1926,
  "letter,": 1927,
  "word:": 1928,
  "72": 1929,
  "world'": 1930,
  "upper": 1931,
  "searches": 1932,
  "at-sign.": 1933,
  "curly": 1934,
  "value:": 1935,
  "spotted": 1936,
  "l": 1937,
  "return-path:": 1938,
  "sat,": 1939,
  "details:": 1940,
  "\ufb01le:": 1941,
  "directory:": 1942,
  "records": 1943,
  "messages.": 1944,
  "characters,": 1945,
  "louis@media.berkeley.edu": 1946,
  "rjlowe@iupui.edu": 1947,
  "fri": 1948,
  "edit": 1949,
  "search6.py": 1950,
  "team": 1951,
  "quality": 1952,
  "pythonic": 1953,
  "\u201cmore": 1954,
  "solution": 1955,
  "old": 1956,
  "returning": 1957,
  "default": 1958,
  "spaces,": 1959,
  "missing": 1960,
  "form:": 1961,
  "0.8475": 1962,
  "cheeses": 1963,
  "[]": 1964,
  "elements,": 1965,
  "t2": 1966,
  "t.sort()": 1967,
  "breaks": 1968,
  "individual": 1969,
  "\u201cfrom\u201d,": 1970,
  "print(words[2])": 1971,
  "split,": 1972,
  "x-dspam-probability:": 1973,
  "0.0000": 1974,
  "subset": 1975,
  "dict": 1976,
  "eng2sp": 1977,
  "indexed": 1978,
  "dictionaries,": 1979,
  "implementation": 1980,
  "d[c]": 1981,
  "histogram": 1982,
  "'chuck'": 1983,
  "'annie'": 1984,
  "'jan':": 1985,
  "100}": 1986,
  "compare": 1987,
  "romeo": 1988,
  "soft": 1989,
  "fair": 1990,
  "kill": 1991,
  "envious": 1992,
  "sick": 1993,
  "pale": 1994,
  "iterating": 1995,
  "+=": 1996,
  "print(key,": 1997,
  "described": 1998,
  "24,": 1999,
  "pair.": 2000,
  "tuple.": 2001,
  "reverse": 2002,
  "'have',": 2003,
  "'have'": 2004,
  "]": 2005,
  "'c':22}": 2006,
  "shape": 2007,
  "plain": 2008,
  "129": 2009,
  "complicated": 2010,
  "basics": 2011,
  "full": 2012,
  "\u201cgreedy\u201d": 2013,
  "greedy": 2014,
  "['cwen@iupui.edu']": 2015,
  "['source@collab.sakaiproject.org']": 2016,
  "\\s": 2017,
  "parser": 2018,
  "nicely": 2019,
  "tries": 2020,
  "period.": 2021,
  "re:": 2022,
  "describe": 2023,
  "receive": 2024,
  "pages,": 2025,
  "certificate": 2026,
  "ctx": 2027,
  "ssl.create_default_context()": 2028,
  "ctx.check_hostname": 2029,
  "ctx.verify_mode": 2030,
  "ssl.cert_none": 2031,
  "context=ctx).read()": 2032,
  "enforce": 2033,
  "https://www.python.org/": 2034,
  "xml,": 2035,
  "html.parser": 2036,
  "page.": 2037,
  "html,": 2038,
  "<name>chuck</name>": 2039,
  "734": 2040,
  "303": 2041,
  "tree": 2042,
  "13.": 2043,
  "'''": 2044,
  "<user": 2045,
  "</user>": 2046,
  "print('user": 2047,
  "count:": 2048,
  "}": 2049,
  "service-oriented": 2050,
  "soa": 2051,
  "contact": 2052,
  "performance": 2053,
  "design": 2054,
  "partyanimal:": 2055,
  "party(self)": 2056,
  "partyanimal()": 2057,
  "convention": 2058,
  "destructor": 2059,
  "self.points": 2060,
  "rows,": 2061,
  "row,": 2062,
  "courses": 2063,
  "conn": 2064,
  "cur": 2065,
  "conn.cursor()": 2066,
  "'my": 2067,
  "conn.commit()": 2068,
  "\u201ccrud\u201d": 2069,
  "15,": 2070,
  "('new": 2071,
  "york',": 2072,
  "sinatra": 2073,
  "model,": 2074,
  "(id": 2075,
  "\u2018frank": 2076,
  "sinatra\u2019": 2077,
  "pointing": 2078,
  "database,": 2079,
  "last_insert_rowid();": 2080,
  "))": 2081,
  "cur.fetchone()[0]": 2082,
  "\"si110\"],": 2083,
  "\"mea\",": 2084,
  "\"rosa\",": 2085,
  "\"si110\",": 2086,
  "loaded": 2087,
  "where.js": 2088,
  "voivodeship,": 2089,
  "where.html": 2090,
  "spidered": 2091,
  "[building": 2092,
  "gmodel.py": 2093,
  "->": 2094,
  "juan": 2095,
  "translation:": 2096,
  "sarah": 2097,
  "scientist.": 2098,
  "100,": 2099,
  "31,": 2100,
  "102,": 2101,
  "23,": 2102,
  "109,": 2103,
  "traversal,": 2104,
  "51,": 2105,
  "105,": 2106,
  "16,": 2107,
  "21,": 2108,
  "19,": 2109,
  "exploring": 2110,
  "cover": 2111,
  "history": 2112,
  "references": 2113,
  "switch": 2114,
  "commons": 2115,
  "scratch": 2116,
  "elkner,": 2117,
  "\ufb01fth": 2118,
  "algorithms": 2119,
  "goal": 2120,
  "handling": 2121,
  "happened": 2122,
  "break,": 2123,
  "he": 2124,
  "beginning.": 2125,
  "chapters": 2126,
  "replaced": 2127,
  "introduced": 2128,
  "early": 2129,
  "lesson": 2130,
  "user-de\ufb01ned": 2131,
  "new,": 2132,
  "network,": 2133,
  "informatics": 2134,
  "programmer.": 2135,
  "except,": 2136,
  "further": 2137,
  "thinking": 2138,
  "share": 2139,
  "maintains": 2140,
  "hope": 2141,
  "help,": 2142,
  "school": 2143,
  "information.": 2144,
  "1.5": 2145,
  "conversing": 2146,
  "terminology:": 2147,
  "journey": 2148,
  "2.9": 2149,
  "exceptions": 2150,
  "36": 2151,
  "finishing": 2152,
  "summing": 2153,
  "literals": 2154,
  "82": 2155,
  "try,": 2156,
  "87": 2157,
  "traversing": 2158,
  "deleting": 2159,
  "125": 2160,
  "comprehension": 2161,
  "140": 2162,
  "143": 2163,
  "145": 2164,
  "world\u2019s": 2165,
  "150": 2166,
  "151": 2167,
  "154": 2168,
  "159": 2169,
  "interfaces": 2170,
  "security": 2171,
  "usage": 2172,
  "subdividing": 2173,
  "171": 2174,
  "classes": 2175,
  "lifecycle": 2176,
  "175": 2177,
  "177": 2178,
  "178": 2179,
  "182": 2180,
  "185": 2181,
  "15.6": 2182,
  "diagrams": 2183,
  "190": 2184,
  "constraints": 2185,
  "translations": 2186,
  "220": 2187,
  "activity.": 2188,
  "helping": 2189,
  "personal": 2190,
  "digital": 2191,
  "amounts": 2192,
  "file:": 2193,
  "skilled": 2194,
  "suited": 2195,
  "bring": 2196,
  "programmers,": 2197,
  "clever": 2198,
  "different": 2199,
  "groups": 2200,
  "meet": 2201,
  "users,": 2202,
  "apart": 2203,
  "second.": 2204,
  "cpu.": 2205,
  "slower": 2206,
  "\ufb02ash": 2207,
  "usb": 2208,
  "portable": 2209,
  "network.": 2210,
  "helps": 2211,
  "art": 2212,
  "\u201cget": 2213,
  "dog,": 2214,
  "\u201ci": 2215,
  "suggest": 2216,
  "completely": 2217,
  "print('hello": 2218,
  "enclosed": 2219,
  "quotes.": 2220,
  "quotes": 2221,
  "quote": 2222,
  "macintosh": 2223,
  "ready": 2224,
  "planet": 2225,
  "inhabitants": 2226,
  "\u02c6\u02c6\u02c6\u02c6": 2227,
  "waiting": 2228,
  "'we": 2229,
  "1)": 2230,
  "chapters,": 2231,
  "defined": 2232,
  "quit()": 2233,
  "incorrect": 2234,
  "prompt.": 2235,
  "translators": 2236,
  "fall": 2237,
  "parses": 2238,
  "(a": 2239,
  "y.": 2240,
  "ordered": 2241,
  "above.": 2242,
  "puts": 2243,
  "c.": 2244,
  "onto": 2245,
  "system.": 2246,
  "answer": 2247,
  "something.": 2248,
  "easiest": 2249,
  "computing": 2250,
  "clown": 2251,
  "occurs.": 2252,
  "car": 2253,
  "imagine": 2254,
  "quicker": 2255,
  "scan": 2256,
  "came": 2257,
  "wrote": 2258,
  "bigcount": 2259,
  "techniques": 2260,
  "anyone": 2261,
  "structure,": 2262,
  "\u201coutside": 2263,
  "sequential": 2264,
  "conditions": 2265,
  "throughout": 2266,
  "sounds": 2267,
  "else,": 2268,
  "against": 2269,
  "perfectly": 2270,
  "help.": 2271,
  "library,": 2272,
  "steps": 2273,
  "do.": 2274,
  "reach": 2275,
  "gas": 2276,
  "bug,": 2277,
  "meant": 2278,
  "you\u2019re": 2279,
  "understand.": 2280,
  "bug": 2281,
  "reading,": 2282,
  "activity": 2283,
  "mode.": 2284,
  "thing.": 2285,
  "\ufb01nish": 2286,
  "pieces": 2287,
  "progress": 2288,
  "revisit": 2289,
  "away": 2290,
  "elegant": 2291,
  "\u201cthe": 2292,
  "structure.": 2293,
  "problem,": 2294,
  "computation.": 2295,
  "e)": 2296,
  "(3)": 2297,
  "tempted": 2298,
  "digits,": 2299,
  "legal": 2300,
  "pi": 2301,
  "3.141592653589793": 2302,
  "letters,": 2303,
  "underscore": 2304,
  "execute.": 2305,
  "statements:": 2306,
  "assignment.": 2307,
  "symbols": 2308,
  "minute/60": 2309,
  "\ufb02oating": 2310,
  "minute": 2311,
  "precedence": 2312,
  "force": 2313,
  "(minute": 2314,
  "100)": 2315,
  "right.": 2316,
  "useful.": 2317,
  "divisible": 2318,
  "another:": 2319,
  "concatenation,": 2320,
  "integer.": 2321,
  "\\n": 2322,
  "function:": 2323,
  "airspeed": 2324,
  "speed": 2325,
  "input(prompt)": 2326,
  "bigger": 2327,
  "beginning,": 2328,
  "35.0": 2329,
  "12.50": 2330,
  "names,": 2331,
  "quick": 2332,
  "extended": 2333,
  "pizza": 2334,
  "words)": 2335,
  "editors": 2336,
  "keywords,": 2337,
  "operations.": 2338,
  "2.0": 2339,
  "concatenate": 2340,
  "simplify": 2341,
  "def,": 2342,
  "(type": 2343,
  "pay:": 2344,
  "worry": 2345,
  "round": 2346,
  "y)": 2347,
  "(:)": 2348,
  "indented.": 2349,
  "33": 2350,
  "print(\u2018x": 2351,
  "body,": 2352,
  "check,": 2353,
  "below:": 2354,
  "determines": 2355,
  "alternatives": 2356,
  "branches.": 2357,
  "ends.": 2358,
  "executes.": 2359,
  "indentation": 2360,
  "user.": 2361,
  "be:": 2362,
  "air": 2363,
  "traceback.": 2364,
  "fahr": 2365,
  "9.0": 2366,
  "input,": 2367,
  "unexpected": 2368,
  "extra": 2369,
  "jumps": 2370,
  "evaluating": 2371,
  "\ufb01ne": 2372,
  "failed": 2373,
  "non": 2374,
  "due": 2375,
  "rule": 2376,
  "insure": 2377,
  "\ufb01nd,": 2378,
  "invisible": 2379,
  "space.": 2380,
  "controls": 2381,
  "depending": 2382,
  "body.": 2383,
  "relative": 2384,
  "executing,": 2385,
  "\ufb01nal": 2386,
  "0.7": 2387,
  "later,": 2388,
  "passing": 2389,
  "max": 2390,
  "\u201clargest": 2391,
  "known": 2392,
  "notation.": 2393,
  "deterministic": 2394,
  "\ufb02oat": 2395,
  "get.": 2396,
  "low": 2397,
  "print_lyrics():": 2398,
  "print(\"i'm": 2399,
  "okay.\")": 2400,
  "day.')": 2401,
  "punctuation": 2402,
  "let": 2403,
  "okay.": 2404,
  "executed,": 2405,
  "alter": 2406,
  "require": 2407,
  "argument:": 2408,
  "composition": 2409,
  "once.": 2410,
  "action": 2411,
  "repetitive": 2412,
  "present": 2413,
  "running.": 2414,
  "run.": 2415,
  "jane": 2416,
  "updates": 2417,
  "x,": 2418,
  "'x'": 2419,
  "eventually": 2420,
  "jump": 2421,
  "suppose": 2422,
  "done.": 2423,
  "write:": 2424,
  "input('>": 2425,
  "hits": 2426,
  "whatever": 2427,
  "done!": 2428,
  "anywhere": 2429,
  "(not": 2430,
  "treats": 2431,
  "skipping": 2432,
  "year:": 2433,
  "while,": 2434,
  "set,": 2435,
  "particular,": 2436,
  "demonstrate": 2437,
  "starts,": 2438,
  "total,": 2439,
  "largest)": 2440,
  "smallest)": 2441,
  "min()": 2442,
  "places": 2443,
  "steps.": 2444,
  "check.": 2445,
  "(often": 2446,
  "terminating": 2447,
  "print(letter)": 2448,
  "typeerror:": 2449,
  "left.": 2450,
  "tempting": 2451,
  "\u201cobject\u201d": 2452,
  "re\ufb01ne": 2453,
  "immutable,": 2454,
  "concatenates": 2455,
  "demonstrates": 2456,
  "substring": 2457,
  "'a'": 2458,
  "'banana':": 2459,
  "methods,": 2460,
  "e\ufb00ectively": 2461,
  "https://docs.python.org/library/stdtypes.html#string-methods.": 2462,
  "73": 2463,
  "invoke": 2464,
  "'have": 2465,
  "day'": 2466,
  "line.lower()": 2467,
  "careful": 2468,
  "at-sign": 2469,
  "host": 2470,
  "42.": 2471,
  "camels.'": 2472,
  "crash": 2473,
  "associated": 2474,
  "speci\ufb01ed": 2475,
  "indices.": 2476,
  "chapter,": 2477,
  "speci\ufb01cally": 2478,
  "exists.": 2479,
  "filenotfounderror:": 2480,
  "[errno": 2481,
  "deal": 2482,
  "attempt": 2483,
  "<postmaster@collab.sakaiproject.org>": 2484,
  "http://source.sakaiproject.org/viewsvn/?view=rev&rev=39772": 2485,
  "\u201cfrom:\u201d": 2486,
  "mbox": 2487,
  "splitting": 2488,
  "discarded.": 2489,
  "compared": 2490,
  "inp.": 2491,
  "pre\ufb01x": 2492,
  "line.startswith('from:'):": 2493,
  "continue.": 2494,
  "\u201cinteresting\u201d": 2495,
  "uninteresting": 2496,
  "author:": 2497,
  "1797": 2498,
  "fact,": 2499,
  "assurance": 2500,
  "created.": 2501,
  "print('file": 2502,
  "opened:',": 2503,
  "exit()": 2504,
  "keeps": 2505,
  "permanent": 2506,
  "egg.py": 2507,
  "\ufb02oat,": 2508,
  "['spam',": 2509,
  "['cheddar',": 2510,
  "'edam',": 2511,
  "'gouda']": 2512,
  "123]": 2513,
  "repeats": 2514,
  "['b',": 2515,
  "['d',": 2516,
  "extend": 2517,
  "'e']": 2518,
  "deletes": 2519,
  "'the',": 2520,
  "split.": 2521,
  "week": 2522,
  "\u2018banana\u2019": 2523,
  "identical,": 2524,
  "a,": 2525,
  "object:": 2526,
  "association": 2527,
  "parameter,": 2528,
  "t[1:]": 2529,
  "hand.": 2530,
  "debug:": 2531,
  "encounters": 2532,
  "collection": 2533,
  "print(eng2sp)": 2534,
  "'uno'": 2535,
  "{'one':": 2536,
  "format.": 2537,
  "structures.": 2538,
  "east": 2539,
  "arise": 2540,
  "moon": 2541,
  "grief": 2542,
  "print(counts)": 2543,
  "dump": 2544,
  "1}": 2545,
  "counts[key])": 2546,
  "annie": 2547,
  "objects,": 2548,
  "print(lst)": 2549,
  "punctuation,": 2550,
  "tostr": 2551,
  "days": 2552,
  "address,": 2553,
  "comparable": 2554,
  "hashable": 2555,
  "'e')": 2556,
  "varying": 2557,
  "constructor,": 2558,
  "sequences.": 2559,
  "dsu": 2560,
  "length,": 2561,
  "valid": 2562,
  "1),": 2563,
  "10),": 2564,
  "('c',": 2565,
  "22)]": 2566,
  "however,": 2567,
  "items,": 2568,
  "key)": 2569,
  "telephone": 2570,
  "contexts,": 2571,
  "list_of_ints_in_strings": 2572,
  "introduce": 2573,
  "organized": 2574,
  "search()": 2575,
  "accomplish": 2576,
  "extraction": 2577,
  "combined": 2578,
  "card": 2579,
  "134": 2580,
  "possible.": 2581,
  "(.*),": 2582,
  "':'": 2583,
  "['0.0000']": 2584,
  ".*": 2585,
  "dollar": 2586,
  "\u201cnon-greedy": 2587,
  "mode\u201d.": 2588,
  "grep.py": 2589,
  "socket,": 2590,
  "wait": 2591,
  "sending": 2592,
  "len(data)": 2593,
  "http/1.1": 2594,
  "apr": 2595,
  "2018": 2596,
  "server:": 2597,
  "apache/2.4.7": 2598,
  "(ubuntu)": 2599,
  "last-modified:": 2600,
  "2017": 2601,
  "etag:": 2602,
  "accept-ranges:": 2603,
  "content-length:": 2604,
  "cache-control:": 2605,
  "max-age=0,": 2606,
  "no-cache,": 2607,
  "no-store,": 2608,
  "must-revalidate": 2609,
  "pragma:": 2610,
  "no-cache": 2611,
  "expires:": 2612,
  "1984": 2613,
  "05:00:00": 2614,
  "connection:": 2615,
  "content-type:": 2616,
  "document.": 2617,
  "headers,": 2618,
  "b'hello": 2619,
  "fhand.close()": 2620,
  "149": 2621,
  "230210": 2622,
  "url,": 2623,
  "img": 2624,
  "opens": 2625,
  "engine": 2626,
  "question": 2627,
  "urllib.request.urlopen(url,": 2628,
  "findall": 2629,
  "highly": 2630,
  "href": 2631,
  "http://www.py4e.com/code3/bs4.zip": 2632,
  "unzip": 2633,
  "bs4": 2634,
  "soup": 2635,
  "beautifulsoup(html,": 2636,
  "soup('a')": 2637,
  "tags:": 2638,
  "none))": 2639,
  "tag.": 2640,
  "genindex.html": 2641,
  "py-modindex.html": 2642,
  "curl": 2643,
  "url.": 2644,
  "3000": 2645,
  "internal": 2646,
  "+1": 2647,
  "4456": 2648,
  "<email": 2649,
  "node": 2650,
  "xml.etree.elementtree": 2651,
  "et": 2652,
  "elementtree": 2653,
  "array": 2654,
  "json.": 2655,
  "\"name\"": 2656,
  "json,": 2657,
  "advance": 2658,
  "succinct": 2659,
  "application.": 2660,
  "reservation": 2661,
  "policy": 2662,
  "oriented": 2663,
  "(stuff.__getitem__(0))": 2664,
  "(list.__getitem__(stuff,0))": 2665,
  "__getitem__": 2666,
  "'__delattr__',": 2667,
  "world\u201d": 2668,
  "draw": 2669,
  "attributes.": 2670,
  "__init__(self):": 2671,
  "setup": 2672,
  "template": 2673,
  "173": 2674,
  "indicating": 2675,
  "cookie": 2676,
  "frosting": 2677,
  "(\"type\",": 2678,
  "clean": 2679,
  "specially": 2680,
  "__init__(self,": 2681,
  "nam": 2682,
  "s.party()": 2683,
  "columns.": 2684,
  "freely": 2685,
  "manager": 2686,
  "column,": 2687,
  "cursor,": 2688,
  "(?,": 2689,
  "rows.": 2690,
  "way'": 2691,
  "normalization": 2692,
  "frank": 2693,
  "(id,": 2694,
  "relationship.": 2695,
  "crow\u2019s": 2696,
  "1|frank": 2697,
  "artist_name": 2698,
  "\ufb01eld": 2699,
  "keys.": 2700,
  "duplicate": 2701,
  "record": 2702,
  "asche": 2703,
  "album,": 2704,
  "rating,": 2705,
  "relationships.": 2706,
  "roster": 2707,
  "table\u201d,": 2708,
  "arrays": 2709,
  "198": 2710,
  "course_id)": 2711,
  "+----+-------+---------+-----------+----+---------+": 2712,
  "course_id,": 2713,
  "situations": 2714,
  "user-entered": 2715,
  "locations": 2716,
  "where.data": 2717,
  "location,": 2718,
  "fine": 2719,
  "https://py4e-data.dr-chuck.net/": 2720,
  "{\"type\":\"featurecoll": 2721,
  "srodmiescie,": 2722,
  "browser.": 2723,
  "http://www.dr-chuck.com/": 2724,
  "(5,": 2725,
  "rerun": 2726,
  "gigabyte": 2727,
  "16.3.": 2728,
  "gmodel.py.": 2729,
  "index.sqlite.": 2730,
  "swgithen@mtu.edu": 2731,
  "organizations": 2732,
  "autograders,": 2733,
  "resources,": 2734,
  "fernando": 2735,
  "contributors": 2736,
  "james": 2737,
  "j.": 2738,
  "(allen": 2739,
  "downey)": 2740,
  "java": 2741,
  "copy,": 2742,
